[
  {
    "version": "1.0.0-a.1",
    "date": "11/07/2024",
    "extra": "This release will be the first release considered as stable. It's still in alpha, but it's the first release that we consider to be stable enough for daily use. You can start using it as your main browser right now if you are reading this!",
    "features": [
      "Stable support for split views",
      "Updated Firefox to version 128.0",
      "Vertical tabs are now supported",
      "Better profile management system",
      "Full support for sidebar web panels",
      "Other minor UI additions and improvements",
      "Added support for an automatic update system"
    ],
    "fixes": [
      {
        "description": "Fixed a bug where the browser would crash when opening any extension",
        "issue": 34
      },
      {
        "description": "Fixed extension icon resolution on the toolbar",
        "issue": 35
      },
      {
        "description": "Applied a fix for that affected some Linux users",
        "issue": 36
      }
    ]
  },
  {
    "version": "1.0.0-a.2",
    "date": "12/07/2024",
    "extra": "This release is the second alpha release of the 1.0.0-alpha series. It includes a lot of bug fixes and improvements given the feedback we received from the first alpha release. This release is still not considered stable, but it's a big step towards the first stable release.",
    "features": ["Added support for macOS aarch64!", "Some performance improvements"],
    "fixes": [
      {
        "description": "Fixed rounded corners of browser views for some websites",
        "issue": 48
      },
      {
        "description": "Fixed audio icon overlapping with the tab container",
        "issue": 41
      },
      {
        "description": "Changed to the correct branding for Zen Home",
        "issue": 50
      }
    ],
    "breakingChanges": ["Removed support window's stub installer. It's under development."]
  },
  {
    "version": "1.0.0-a.3",
    "date": "14/07/2024",
    "extra": "This release is the third alpha release of the 1.0.0-alpha series. One big feature of this release is the new workspaces feature. This feature allows you to create different workspaces with different tabs and configurations. This release also includes a lot of bug fixes and improvements.",
    "features": ["Added support for workspaces (Experimental)", "Better support for macOS aarch64"],
    "fixes": [
      {
        "description": "Fixed subwindows not being displayed correctly",
        "issue": 54
      },
      {
        "description": "Fixed Zen's compact view mode",
        "issue": 45
      },
      {
        "description": "Fixed displaying tab icons when they are pinned",
        "issue": 52
      }
    ],
    "breakingChanges": [
      "Changed the update URL meaning that since 1.0.0-a.2 (previous release) the browser will be able to update itself"
    ]
  },
  {
    "version": "1.0.0-a.4",
    "date": "14/07/2024",
    "extra": "This release is the fourth alpha release of the 1.0.0-alpha series. This release includes a lot of bug fixes and improvements. The main focus of this release was to improve some small details and the compact view mode.\n\nThis release is very small but it includes some important fixes and I wont be able to work on the browser for the next few days so I decided to release it now.\n\nSorry!",
    "features": [
      "Improved compact view mode",
      "Tabs with no icons will now display a default icon",
      "Improved workspaces feature (Experimental)",
      "Added support for pinned tabs"
    ],
    "fixes": [
      {
        "description": "Fixed the compact view mode not displaying correctly when it's not fullscreen",
        "issue": 58
      },
      {
        "description": "Fixed \"Weird margins in popup windows\"",
        "issue": 54
      },
      {
        "description": "Fixed pinned tab icons not being displayed correctly",
        "issue": 52
      }
    ]
  },
  {
    "version": "1.0.0-a.5",
    "date": "16/07/2024",
    "extra": "This release is a very small release that includes some speed improvements and privacy improvements. This release is the fifth alpha release of the 1.0.0-alpha series.",
    "features": [
      "Improved performance of the browser, specially for Windows users",
      "Changed some of Firefox's default privacy settings to improve privacy",
      "Allowed using GPU for rendering by default",
      "Set the default user agent to Firefox"
    ],
    "fixes": [
      {
        "description": "Fixed license not being clear",
        "issue": 62
      },
      {
        "description": "Fixed Zen not being able to execute on some Linux distributions",
        "issue": 36
      },
      {
        "description": "Fixed sites like whatsapp web not working correctly",
        "issue": 59
      },
      {
        "description": "Fixed some background overlapping the browser view",
        "issue": 48
      }
    ]
  },
  {
    "version": "1.0.0-a.6",
    "date": "24/07/2024",
    "extra": "Hello there! Sorry for not updating so frequently, i've been busy this week.\n\nWelcome to the sixth alpha release of the 1.0.0-alpha series, gettin' closer to the first stable release!\n\nThis release includes a lot of bug fixes and improvements. The main focus of this release was to improve some small details and performance.",
    "features": [
      "Improved performance of the browser",
      "Added support for the latest version of Firefox (128.0.2)",
      "Improved the compact view mode",
      "Started working on flatpak support",
      "Improved the workspaces feature by adding icons and control buttons",
      "Implemented better branding for the Installer",
      "Created better better visual feedback for the user with Animations and Split views",
      "Made an opt-out for the watermark",
      "Enabled further customization by adding Pilled Buttons toggle",
      "Added performance focused user settings by default",
      "Added theme-related profile avatars",
      "Added a way to expand the sidebar tabs and to be able to customize the sidebar",
      "Started experimenting with PGO builds. Currently Linux only.",
      "Added scrollable tabs support",
      "Added context menu button for quick sidebar website addition",
      "Enabled smooth scrolling by default",
      "Added container identification to the tab bar"
    ],
    "fixes": [
      {
        "description": "Fixed pinned tabs not being displayed correctly"
      },
      {
        "description": "Fixed pressing \"Bookmarks\" twice in the bottom left doesn't close the bookmarks tab",
        "issue": 74
      },
      {
        "description": "Fixed wrong colors for web-content popups",
        "issue": 70
      },
      {
        "description": "Fixed padding when DOM fullscreen is enabled",
        "issue": 67
      },
      {
        "description": "Tab Bar Icons Hidden When Many Tabs are Open",
        "issue": 64
      },
      {
        "description": "Disabled Zen Workspaces when private browsing is enabled"
      },
      {
        "description": "Fixed web view padding when opening a hidden popup",
        "issue": 54
      },
      {
        "description": "The Windows NSIS installer correctly installs the browser in the right path now instead of \"Mozilla Developer Preview\""
      },
      {
        "description": "Fixed overall Windows installer branding"
      },
      {
        "description": "Fixed update URLs and support links"
      }
    ],
    "breakingChanges": [
      "Updated CPU requirements for x86_64-v3",
      "Changed the way profile avatars are stored, may not be any issues, please report them if you find any"
    ]
  },
  {
    "version": "1.0.0-a.7",
    "date": "27/07/2024",
    "extra": "This release is the seventh alpha release of the 1.0.0-alpha series. This release includes some important bug fixes and improvements. The main focus of this release was to improve some small details and improve stability.",
    "features": [
      "A grid system for pinned tabs",
      "Flatpak support",
      "More performance improvements",
      "Added newtab wallpapers (Version 2)",
      "Enabled hiding floating sidebar web panels when clicking outside",
      "Branded more the installer",
      "Used more intuitive icons for the sidebar",
      "Improved animations",
      "More compact view stability improvements"
    ],
    "fixes": [
      {
        "description": "Fixed the browser crashing when updating on Linux",
        "issue": 76
      },
      {
        "description": "Fixed workspace deleting button, deleting the wrong workspace",
        "issue": 81
      },
      {
        "description": "Fixed the expanded sidebar for the compact view",
        "issue": 79
      },
      {
        "description": "Fixed small margin on hidden windows"
      }
    ]
  },
  {
    "version": "1.0.0-a.8",
    "date": "29/07/2024",
    "extra": "This release is the eighth alpha release of the 1.0.0-alpha series.\n\nThis release includes some small bug fixes and improvements. The main focus of this release was to improve some small details and improve stability.",
    "features": [
      "Added support for the latest version of Firefox (128.0.3).",
      "Improved the compact view mode",
      "New logo for the browser!",
      "Improved speed of the browser"
    ],
    "fixes": [
      {
        "description": "Lowered the CPU requirements for Linux users"
      },
      {
        "description": "Fixed browser updater crashing on some Linux distributions",
        "issue": 76
      },
      {
        "description": "Added more contrast to web context menus on light mods",
        "issue": 88
      },
      {
        "description": "Fixed horizontal separator not showing on pinned tabs",
        "issue": 100
      },
      {
        "description": "Created a small hotfix for mods and some broken extensions",
        "issue": 89
      }
    ],
    "breakingChanges": ["Changed the ID for flatpak to io.github.zen_browser.zen"]
  },
  {
    "version": "1.0.0-a.11",
    "date": "02/08/2024",
    "extra": "This release is the eleventh alpha release of the 1.0.0-alpha series.\n\nWe skipped some releases because we were working on some big features and improvements. This release includes some big performance improvements and support for other platforms.\n\nHopefully things will get a bit more stable from now on.",
    "features": [
      "Added support for Windows Generic CPUs",
      "Added support for Linux Generic CPUs",
      "Added support for macOS x86_64 CPUs",
      "Added support for macOS arm64 CPUs",
      "Allow the user to change the sidebar's max width",
      "Started to work on a new onboarding experience",
      "Support for AppImage. Both specific and generic.",
      "New icons for MacOS and Windows/Linux. Different icons for each OS.",
      "Added a floating URL bar option",
      "Added option to hide the toolbar as well in compact view",
      "Move security button to the right of the URL bar",
      "Added introduction for side web panels",
      "Drastically improved the performance of the browser"
    ],
    "fixes": [
      {
        "description": "Fixed the browser crashing when updating on macOS",
        "issue": 84
      },
      {
        "description": "Fixed 'Couldn't load XPCOM' error on some Windows installations",
        "issue": 107
      },
      {
        "description": "Fixed the browser crashing when updating on Linux"
      },
      {
        "description": "Fixed pinned tabs not being properly aligned",
        "issue": 110
      },
      {
        "description": "Remove padding around close button on Windows",
        "issue": 134
      },
      {
        "description": "Fixed a part of the tab list and the corner border is showing/clipping in Fullscreen",
        "issue": 124
      }
    ],
    "breakingChanges": ["Changed the ID for AppImage to io.github.zen_browser.zen"]
  },
  {
    "version": "1.0.0-a.12",
    "date": "04/08/2024",
    "extra": "This release is the twelfth alpha release of the 1.0.0-alpha series.\n\nThis release includes some nice features and improvements. The main focus of this release was to improve some small details and improve stability.",
    "features": [
      "Added support for the vertical tabs to remember their width",
      "Added support for disallowing the sidebar web panels to closed when clicked outside and floating (Settings)",
      "Added support for the sidebar web panels to remember their width and if they are floating",
      "Allow installing unsigned extensions",
      "Improved onboarding experience",
      "New compact mode design, it's much better now",
      "Reduced CPU requirements for MacOS Intel CPUs",
      "Reduced blur for floating URL bar",
      "Allow the sidebar to be wider, customizable in about:config"
    ],
    "fixes": [
      {
        "description": "Task Manager Icon Missing in Flatpak Version",
        "issue": 146
      },
      {
        "description": "Clicking \"Next\" on \"Choose your search engine\" intro page does nothing",
        "issue": 145
      },
      {
        "description": "Crash Report on Intel Mac running Monterey 12.7",
        "issue": 144
      },
      {
        "description": "Fixed pinned tabs not being properly aligned"
      },
      {
        "description": "\"Delete Web Panel\" closes the sidebar",
        "issue": 143
      },
      {
        "description": "Disallow remove workspace deletion for default workspace",
        "issue": 136
      },
      {
        "description": "Fixed small sidebar display bug",
        "issue": 125
      }
    ]
  },
  {
    "version": "1.0.0-a.13",
    "date": "05/08/2024",
    "extra": "This is a smaller release to fix some bugs and improve some small details.\n\nIm going to try doing more frequent releases from now on, see how it goes.",
    "features": ["Allow to remember sidebar width even after collapsing it."],
    "fixes": [
      {
        "description": "Task Manager Icon Missing in Flatpak Version",
        "issue": 146
      },
      {
        "description": "Condensed Vertical Tabs not working in Compact Mode",
        "issue": 160
      },
      {
        "description": "Remember sidebar width on toggle",
        "issue": 149
      },
      {
        "description": "Fixed startup issue with AppImage"
      },
      {
        "description": "Fixed typos on the onboarding experience"
      }
    ]
  },
  {
    "version": "1.0.0-a.15",
    "date": "07/08/2024",
    "extra": "This release is the fifteenth alpha release of the 1.0.0-alpha series.\n\nI've skipped version 1.0.0-a.14 because of the quality of the release, it was not good enough to be released.\n\nThis release includes some bug fixes and improvements.\n\nThanks everyone for the feedback! It may look like a small release but it includes some important fixes and improvements.",
    "features": [
      "Added support for the latest version of Firefox (129.0)",
      "Reworked on split views",
      "Improved the performance of the browser",
      "Allow the sidebar to be at the right side of the browser"
    ],
    "fixes": [
      {
        "description": "Blank space when closing tabs",
        "issue": 181
      },
      {
        "description": "Tab bar: misaligned icons and hover background",
        "issue": 180
      }
    ]
  },
  {
    "version": "1.0.0-a.17",
    "date": "11/08/2024",
    "extra": "This release is the seventeenth alpha release of the 1.0.0-alpha series.\n\nThis release includes some bug fixes and improvements.\n\nThanks everyone for the feedback! We've skipped version 1.0.0-a.16 because of the size of the releases. One more step closer to the first stable release!",
    "features": [
      "Added support for default keyboard shortcuts",
      "Added JavaScript Bytecode Cache",
      "Added shortcuts for split views",
      "Updated UserAgent for website panels (Mobile UserAgent)",
      "Added support for zsync in AppImages",
      "New tab button is now stuck to the last tab",
      "Any inactive tab will be dimmed",
      "Allowed prefetching for network requests",
      "Added security measures for the browser (Sandboxing)",
      "Added more optimizations for Specific CPUs",
      "Added shortcuts for cycling through workspaces",
      "Fixed settings linguistics",
      "Promoted hardware acceleration for flatpaks",
      "Added shortcut for toggling the sidebar",
      "Windows generic CPU support is now stable!"
    ],
    "fixes": [
      {
        "description": "Toolbar only partially shown in Compact Mode",
        "issue": 205
      },
      {
        "description": "Closed tabs are not really closed",
        "issue": 216
      },
      {
        "description": "Getting 0xc0000142 error while trying to open zen.exe",
        "issue": 209
      },
      {
        "description": "Fixed pinned tabs separator display issue",
        "issue": 195
      }
    ]
  },
  {
    "version": "1.0.0-a.23",
    "date": "18/08/2024",
    "extra": "This release is the twenty-third alpha release of the 1.0.0-alpha series.\n\nWe have made a lot of improvements and bug fixes since the last release note. I will go over the most important changes since version 1.0.0-a.17.\n\nThanks to everyone for the feedback and support!!",
    "features": [
      "Added support for the latest stable version of Firefox (129.0.1)",
      "Added security warning when changing the language",
      "Locked preferences for Mozilla telemetry and experiments",
      "Refactored parts of the Zen interface theme",
      "Disabled Reader Mode's parse-on-load function",
      "Updated network and buffer preferences",
      "Improved font rendering",
      "Introduced support for WebAssembly SIMD",
      "Optimized macOS version for Nehalem architecture",
      "Added Branding Assets page",
      "Released Theme Store",
      "Added documentation for submitting mods",
      "Added confirm theme removal button",
      "Released Floating URL Bar feature as an official theme",
      "Released an official theme to remove browser padding"
    ],
    "fixes": [
      {
        "description": "No option to disable dimming inactive tabs",
        "issue": 225
      },
      {
        "description": "Closed tabs reappear if restore previous tabs on startup is enabled ",
        "issue": 230
      },
      {
        "description": "Can't move tabs between workspaces",
        "issue": 237
      },
      {
        "description": "Zen Browser is damaged and can't be opened on macOS",
        "issue": 53
      },
      {
        "description": "Floating URL Bar does not close",
        "issue": 252
      },
      {
        "description": "Web panel can go out of bounds if it is not pinned",
        "issue": 267
      },
      {
        "description": "Bookmarks bar does not match the selected theme",
        "issue": 264
      },
      {
        "description": "Tab backgrounds overlap on hover",
        "issue": 303
      }
    ]
  },
  {
    "version": "1.0.0-a.24",
    "date": "20/08/2024",
    "extra": "This release is the twenty-fourth alpha release of the 1.0.0-alpha series.\n\nThis release brings the long-awaited expand on hover feature, as well as some bug fixes and improvements to the theme store and documentation.",
    "features": [
      "Added a frequently asked questions page to the documentation",
      "Added platform specific preferences to Zen mods",
      "Added expand-on-hover feature for the tab sidebar",
      "Improved scrollbar appearance on Windows",
      "Improved URL bar background color"
    ],
    "fixes": [
      {
        "description": "Mute button is shown on inactive collapsed tabs",
        "issue": 322
      },
      {
        "description": "Visual bug on bottom sidebar buttons",
        "issue": 304
      },
      {
        "description": "Closing tabs makes other tabs briefly smaller",
        "issue": 337
      },
      {
        "description": "Checkboxes are hard to see",
        "issue": 103
      }
    ]
  },
  {
    "version": "1.0.0-a.26",
    "date": "20/08/2024",
    "extra": "This release is the twenty-sixth alpha release of the 1.0.0-alpha series.\n\nThis is a short release that addresses some important bugs.",
    "features": [
      "Updated to the latest stable version of Firefox (129.0.2)",
      "Updated CSS to improve compact mode and vertical tabs styling",
      "Updated the browser logo for Windows to a higher resolution",
      "Fixed severe issue with platform specific preference handling",
      "Added feature to set a default workspace"
    ],
    "fixes": [
      {
        "description": "Issue with edge detection for expand-on-hover sidebar feature",
        "issue": 355
      }
    ]
  },
  {
    "version": "1.0.0-a.28",
    "date": "22/08/2024",
    "extra": "This release is the twenty-eighth alpha release of the 1.0.0-alpha series.",
    "features": [
      "Enabled JPEG XL",
      "Changed Zen Core Components license to CC BY-SA",
      "Added support for color mods in theme creation",
      "Fixed sidebar shortcuts",
      "Started work on browser translations"
    ],
    "fixes": [
      {
        "description": "No way to restore native theming to toolbar",
        "issue": 426
      },
      {
        "description": "Address bar icons are hidden",
        "issue": 430
      },
      {
        "description": "Tabs don't appear in vertical tab bar",
        "issue": 429
      },
      {
        "description": "Location bar is not focused when opening new window",
        "issue": 414
      },
      {
        "description": "The threshold for the expanded tab sidebar in compact mode is too high",
        "issue": 389
      }
    ]
  },
  {
    "version": "1.0.0-a.29",
    "date": "24/08/2024",
    "extra": "This release is the twenty-ninth alpha release of the 1.0.0-alpha series.",
    "features": [
      "Added Spanish translations",
      "Added documentation for contributing",
      "Added support for multi-tab splitting with shortcuts",
      "Fixed sidebar shortcuts"
    ],
    "fixes": [
      {
        "description": "Text on websites is blurry",
        "issue": 383
      },
      {
        "description": "Expanded compact mode triggers too early",
        "issue": 520
      },
      {
        "description": "Ampersand in workspace name breaks workspace menu",
        "issue": 439
      }
    ]
  },
  {
    "version": "1.0.0-a.30",
    "date": "26/08/2024",
    "extra": "This release is the thirtieth alpha release of the 1.0.0-alpha series.",
    "features": [
      "Added support for 24 more languages!",
      "Update installed mods from the browser settings"
    ],
    "fixes": [
      {
        "description": "Letterboxing option is missing",
        "issue": 475
      },
      {
        "description": "Collapsed tabs move when audio is playing",
        "issue": 608
      },
      {
        "description": "Screensaver starts while a video is running in fullscreen",
        "issue": 619
      },
      {
        "description": "Can't scroll through list of workspaces",
        "issue": 603
      },
      {
        "description": "Can't rename created workspace",
        "issue": 604
      },
      {
        "description": "JavaScript won't execute in the browser console",
        "issue": 913
      }
    ]
  },
  {
    "version": "1.0.0-a.33",
    "date": "30/08/2024",
    "extra": "This release is the thirty-third alpha release of the 1.0.0-alpha series.",
    "features": [
      "Fixed policies for updates",
      "Enforce HTTPS-Only Mode",
      "URL bar improvements",
      "Fixed issue with opening links from external apps",
      "Compact mode now takes element separation into account",
      "Added labels to buttons during expand-on-hover"
    ],
    "fixes": [
      {
        "description": "Tab bar stuck on right side",
        "issue": 1115
      }
    ]
  },
  {
    "version": "1.0.0-a.35",
    "date": "02/09/2024",
    "extra": "This release is the thirty-fifth alpha release of the 1.0.0-alpha series. Things are getting stable!",
    "features": [
      "Added option to restore legacy toolbar interface",
      "Added profile-guided optimization (Windows)",
      "Added experimental Zen Labs settings",
      "Changed interface colors",
      "Disabled efficiency-mode by default (Windows)",
      "Enabled GPU-accelerated web rendering by default",
      "Enabled Video Acceleration API for media decoding",
      "Improved support for translations",
      "Added Identical Code Folding compiler optimization"
    ],
    "fixes": [
      {
        "description": "Zen Browser is damaged and can't be opened on macOS",
        "issue": 53
      },
      {
        "description": "Can't reorganize tabs in compact mode",
        "issue": 1168
      },
      {
        "description": "Theme Store settings page doesn't display installed mods",
        "issue": 1125
      },
      {
        "description": "No Homebrew support",
        "issue": 273
      },
      {
        "description": "Remember last active workspaces on startup",
        "issue": 240
      }
    ]
  },
  {
    "version": "1.0.0-a.39",
    "date": "09/09/2024",
    "workflowId": 29912810500,
    "extra": "This release is the thirty-eighth alpha release of the 1.0.0-alpha series.",
    "features": [
      "Successfully added Apple developer certificate (macOS)",
      "Fixed issue with ffmpeg VA-API decoding",
      "Ensure tab becomes visible when selected",
      "Ensure top toolbar remains visible when dragging the window",
      "Briefly show tab sidebar when switching tabs in compact mode",
      "Enabled JPEG XL support by default",
      "Enabled moving pages in the Web View Sidebar",
      "Improved responsiveness of the top toolbar",
      "Enabled fused multiply-add instructions (optimization)"
    ],
    "fixes": [
      {
        "description": "Scrolling between tabs is buggy/slow",
        "issue": 1340
      },
      {
        "description": "Broken hover effect with NewTab button with compact density interface",
        "issue": 1224
      },
      {
        "description": "Issue on Google Meet regarding WebRTC",
        "issue": 972
      },
      {
        "description": "Zen Browser.app is damaged and can’t be opened on macOS",
        "issue": 1245
      },
      {
        "description": "Fixed issue with ⌘ keyboard shortcuts on macOS",
        "issue": 376
      }
    ]
  },
  {
    "version": "1.0.1-a",
    "date": "15/09/2024",
    "workflowId": 10911842349,
    "extra": "This version marks a more stable alpha release.\n\nThis release brings a few improvements to the UI and some important quality of life features for workspaces, such as separate pinned tabs, custom icons and assigned tab containers!\n\nWe've also added a new AppImage installer for Linux users and started signing our Windows builds with a verified digital signature, making Windows Defender and other antivirus software less annoying!\n\nAlso, we've made the browser's layout more stable for mods, improved overall UX and added an a better theme support (Now called Zen Mods)!",
    "features": [
      "Added verified digital signature to Windows builds",
      "Added Zen to Homebrew Cask repository",
      "Enabled private search suggestions by default",
      "Improved Theme Store settings page",
      "Added Night and Colorful mods",
      "Restore browsing session on startup by default",
      "Added preference for custom workspace icons",
      "Redesigned url bar and workspaces",
      "Added preference for separate pinned tabs per workspace",
      "Fixed padding on right side tabs and expand-on-hover",
      "Repositioned List All Tabs button",
      "Allow binding tab containers to workspaces",
      "Added new AppImage installer",
      "Improved bookmarks sidebar interface",
      "Added compatibility for legacy Zen Theme preferences"
    ],
    "fixes": [
      {
        "description": "Window borders show in full-screen mode",
        "issue": 1404
      },
      {
        "description": "Collapsed sidebar widens on warning",
        "issue": 1325
      },
      {
        "description": "Blurry font when using 2x pixel density (macOS)",
        "issue": 440
      },
      {
        "description": "Firefox Add-ons won't update",
        "issue": 1173
      }
    ]
  },
  {
    "version": "1.0.1-a.2",
    "date": "17/09/2024",
    "workflowId": 10966772761,
    "extra": "This release could be considered a hotfix release for the previous version.\n\nSince we've started doing pretty big UI changes in order to gain more stability, it's normal that we may encounter some bugs... But not that many!\n\nThis release fixes some of the most important bugs that were introduced in the previous version and adds some small improvements.",
    "features": [
      "Added entering animation when creating a new tab",
      "Added support for other tab icons such as audio and microphone",
      "Added more customization towards rounded borders and padding",
      "Newtab button is now colored when expanded",
      "MacOS users will have the legacy toolbar location by default",
      "Workspaces are disabled on private browsing"
    ],
    "fixes": [
      {
        "description": "Fixed padding of buttons when expanding the sidebar"
      },
      {
        "description": "Fixed favicon not centered when collapsed"
      },
      {
        "description": "Fixed compact mode overlapping the tab bar"
      },
      {
        "description": "Fixed fullscreen when entering compact mode"
      },
      {
        "description": "Fixed close icon showing on pinned tabs"
      },
      {
        "description": "Fixed websites moving when hovering over tabs"
      },
      {
        "description": "Removed 'private browsing' text from the toolbar"
      },
      {
        "description": "Fixed avatars not being rounded"
      },
      {
        "description": "Fixed paddings for personal toolbar"
      },
      {
        "description": "Fixed width of the tab not being correct"
      },
      {
        "description": "Fixed the tab bar not being visible in fullscreen"
      },
      {
        "description": "Sidebar wont interfere with the toolbar anymore in compact mode"
      },
      {
        "description": "Fixed release notes pointing to a 404 page"
      }
    ]
  },
  {
    "version": "1.0.1-a.3",
    "date": "22/09/2024",
    "workflowId": 10984599633,
    "extra": "We are thrilled to announce that this release marks a significant leap forward for Zen Browser.\n\nSince the last version (1.0.1-a.2), we've implemented numerous improvements and addressed key bug fixes, all aimed at enhancing your browsing experience.\n\nWe've made significant changes to the UI, including a new compact mode design, improved tab management, and a more intuitive user interface. We've also added new features, such as the ability to customize the tab bar and a new compact mode design.\n\nWe hope you enjoy this release and look forward to your feedback!",
    "features": [
      "Compact mode now allows to only hide the toolbar",
      "Added support for customizing the tab bar",
      "Added a new layout that saves vertical space",
      "Added support for workspaces icon strip (Quick workspace switching)",
      "Increased the font size on tabs",
      "Added support for customizing all the buttons that where before at the bottom left",
      "Added support for context menu clicks on the tab bar (compact mode and on hover)",
      "Added support for a new compact mode design",
      "Allowed text fragments for the DOM by default",
      "Added support for resizing split views",
      "Added a keyboard shortcut to cycle through workspaces backwards",
      "Compact mode now stays open for a longer time if the mouse exits the app",
      "MacOS buttons will now be at the left side of the toolbar",
      "Updated to the latest version of Firefox (130.0.1)",
      "Added a way to modify compact mode behavior from right clicking the tab bar",
      "No paddings or borders will be shown when in fullscreen no more",
      "Applied a more consistent design for the tab bar",
      "Correctly signed the Windows updater"
    ],
    "fixes": [
      {
        "description": "Can't split tab, if one of the tabs has been previously split",
        "issue": 1592
      },
      {
        "description": "Exit button padding is not correct",
        "issue": 1583
      },
      {
        "description": "Font size is too small on tabs",
        "issue": 1580
      },
      {
        "description": "Misaligned padding across window",
        "issue": 1542
      },
      {
        "description": "Fixed exiting from split view with more than 6 tabs",
        "issue": 1539
      },
      {
        "description": "Fixed the sidebar ignoring the mobile user agent checkbox on creation",
        "issue": 1536
      },
      {
        "description": "\"Hide the default container indicator in the tab bar\" doesn't work when opening container with shortcut or via link",
        "issue": 1472
      },
      {
        "description": "Left, Bottom, and Right borders visible when in full screen mode",
        "issue": 1513
      },
      {
        "description": "Fixed checkboxes on context menu not being aligned"
      },
      {
        "description": "Fixed Mods not being applied to every single window opened"
      }
    ],
    "breakingChanges": ["Removed Galaxy and Dream mods", "Removed the 'legacy-toolbar' preference"],
    "themeChanges": [
      "Themes will now be able to have string and number values",
      "The configuration schema for mods has been updated. All current mods have been updated automatically."
    ]
  },
  {
    "version": "1.0.1-a.4",
    "date": "23/09/2024",
    "workflowId": 11000317603,
    "extra": "This update addresses some significant issues with the previous release.\n\nWe appreciate your patience and support!",
    "features": ["Added a new system for handling keyboard shortcuts"],
    "fixes": [
      {
        "description": "The New Tab button is not visible",
        "issue": 1640
      },
      {
        "description": "The Unified Extensions button is not visible",
        "issue": 1643
      },
      {
        "description": "The workspace element can't be moved on the toolbar",
        "issue": 1636
      },
      {
        "description": "Expand-on-hover doesn't work properly when compact mode is enabled"
      },
      {
        "description": "Fixed an issue with reordering tabs"
      }
    ]
  },
  {
    "version": "1.0.1-a.5",
    "date": "24/09/2024",
    "workflowId": 11020784612,
    "extra": "This update is a small patch to fix some issues that weren't addressed in the previous release!",
    "features": [
      "Moved application menu button to the right",
      "Added new shortcuts",
      "Collapsed tab sidebar is now smaller"
    ],
    "fixes": [
      {
        "description": "Fixed issue with hovering over window control buttons (macOS)"
      },
      {
        "description": "(Hopefully) resolved all issues with keyboard shortcuts",
        "issue": 1629
      }
    ]
  },
  {
    "version": "1.0.1-a.6",
    "date": "29/09/2024",
    "workflowId": 11095257662,
    "extra": "This release fixes a few critical bugs and introduces Tab Unloading! Unused tabs will free up memory with this new feature",
    "features": [
      "Added Paste and Go button",
      "Added Tab Unloading",
      "Sidebar Web Panel can now be moved freely",
      "Added warning when shortcut setting changes are unsaved",
      "Enabled container tabs by default",
      "Improved Expand Tabs on Hover layout"
    ],
    "themeChanges": ["Toggle inputs will not use the themed tertiary color"],
    "breakingChanges": [
      "The keyboard shortcuts will be overridden by the defaults ones in this update"
    ],
    "fixes": [
      {
        "description": "Fixed Firefox add-ons not updating",
        "issue": 1173
      },
      {
        "description": "Fixed expand-on-hover shifting web page",
        "issue": 1718
      },
      {
        "description": "Fixed cycling between workspaces with shortcuts"
      },
      {
        "description": "Removed duplicate shortcut options in the settings",
        "issue": 1784
      },
      {
        "description": "Restored missing keyboard shortcuts",
        "issue": 1706
      },
      {
        "description": "Fixed keyboard shortcuts not saving",
        "issue": 1715
      },
      {
        "description": "Fixed workspace names that start with an emoji",
        "issue": 1732
      },
      {
        "description": "Fixed shortcut keys incorrectly displayed on macOS"
      }
    ]
  },
  {
    "version": "1.0.1-a.7",
    "date": "01/10/2024",
    "workflowId": 11108707060,
    "extra": "This release is a really small release to fix a very important bug that was introduced in the previous release.",
    "fixes": [
      {
        "description": "Fixed a critical issue with the sidebar being 1 pixel small"
      },
      {
        "description": "Fixed tabs separation always showing"
      }
    ]
  },
  {
    "version": "1.0.1-a.8",
    "date": "10/10/2024",
    "workflowId": 11279059812,
    "extra": "This release brings Zen to Firefox v131.0.2, which patches a significant security vulnerability.\n\nThis update improves the split view and pinned tabs features.\nWe have also released Zen Twilight; automated unstable builds where you can test out the latest features!",
    "features": [
      "Updated to the latest stable version of Firefox (131.0.2)",
      "Added floating compact mode",
      "Allow moving split view tabs with drag and drop functionality",
      "Added option to reset pinned tabs to original state on close",
      "Added support for syncing workspaces",
      "Allow opening tabs by middle clicking the tab sidebar"
    ],
    "fixes": [
      {
        "description": "Fixed tab sidebar flickering when on the right"
      },
      {
        "description": "Fixed performance issue when scrolling"
      },
      {
        "description": "Fixed buffering issues on YouTube"
      },
      {
        "description": "Fixed Zen Mod settings page crashing when a mod ceases to exist"
      },
      {
        "description": "Fixed extension menu breaking compact mode when held open",
        "issue": 1925
      },
      {
        "description": "Fixed internal keyboard shortcuts for macOS",
        "issue": 1629
      },
      {
        "description": "Fixed display issues with certain keyboard layouts",
        "issue": 1930
      },
      {
        "description": "Applied patches to fix CVE-2024-9680",
        "issue": 1993
      }
    ]
  },
  {
    "version": "1.0.1-a.9",
    "date": "14/10/2024",
    "workflowId": 11333793682,
    "extra": "This update brings further refinements to Zen Browser, focusing on stability improvements and new features for session management.\n\nWe've also enhanced pinned tab handling and workspaces to improve the user experience. Thanks everyone!",
    "features": [
      "Updated to the latest stable version of Firefox (131.0.3)",
      "Improved session storage of pinned tabs, now storing the triggering principal for more accurate state restoration",
      "Added a new feature to save the pinned state of tabs in the session store, allowing for better tab management across sessions",
      "Reduced the vertical tab toolbox width to 44px, providing a more compact layout and freeing up more screen space for content",
      "Added support for containers in the sidebar websites",
      "Changed AMOLED theme's base color",
      "Worked on keyboard shortcuts",
      "Improved light mode experience",
      "Allow VAAPI/FMPEG APIs only for Linux",
      "Twilight will now display the proper name on .desktop files",
      "Added a better icon selection for workspaces, enhancing more icons",
      "Created a \"Force container workspace\" option. Basically, force each container to belong to a certain workspace.",
      "Bookmarks are now opened in the workspace's default container",
      "Allow tab unloader to ignore picture-in-picture tabs"
    ],
    "fixes": [
      {
        "description": "Disabled forcing hardware accelerating, causing issues for some unsupported GPUs"
      },
      {
        "description": "Fixed compact mode overlapping the tabs"
      },
      {
        "description": "Fixed browser bottom padding misaligned",
        "issue": 2007
      },
      {
        "description": "Sidebar is blank when there's a moving video/picture on other open tabs",
        "issue": 1900
      },
      {
        "description": "Fixed extension menu breaking compact mode when held open",
        "issue": 1925
      },
      {
        "description": "Fixed 'Sidebar is very thin making stuff not appear correctly'",
        "issue": 2015
      },
      {
        "description": "Fixed 'Tabs sidebar Expand on Hover causes jank with latest UI'",
        "issue": 2033
      },
      {
        "description": "Applied patches to fix mfsa2024-53 security issue"
      },
      {
        "description": "Major issue with zen sidebar disappearing and not re-appearing on restart",
        "issue": 1979
      }
    ]
  },
  {
    "version": "1.0.1-a.10",
    "date": "15/10/2024",
    "workflowId": 11349525400,
    "extra": "This release is a small patch to fix some issues on keyboard shortcuts that were introduced in the previous release.",
    "fixes": [
      {
        "description": "Fixed keyboard shortcuts not working in macOS",
        "issue": 1629
      },
      {
        "description": "Fixed handling of corrupted mod files"
      },
      {
        "description": "Fixed resetting shortcuts not working"
      },
      {
        "description": "Fixed settings UI when night theme is enabled while having a light website displayed"
      },
      {
        "description": "Fixed about page linking 'global Community' to a Mozilla page"
      }
    ],
    "features": [
      "About page will now display the Firefox version used",
      "Disabled forcing container grouping for workspaces"
    ]
  },
  {
    "version": "1.0.1-a.11",
    "date": "19/10/2024",
    "workflowId": 11412027026,
    "extra": "This release brings some quality of life improvements and new features to Workspaces.",
    "fixes": [
      {
        "description": "Fixed right side tab bar not working (macOS)",
        "issue": 334
      },
      {
        "description": "Fixed compact mode moving titlebar buttons (macOS)",
        "issue": 1872
      },
      {
        "description": "Fixed expand on hover moving sites",
        "issue": 2033
      },
      {
        "description": "Fixed About Zen showing incorrect Firefox version",
        "issue": 2150
      },
      {
        "description": "Fixed workspace icon picker no longer showing (Windows)",
        "issue": 2121
      },
      {
        "description": "Fixed inconsistent padding on toolbar buttons",
        "issue": 2176
      },
      {
        "description": "Fixed workspace buttons lacking top and bottom padding when placed on the toolbar",
        "issue": 2184
      },
      {
        "description": "Allow reserved keyboard shortcuts to be changed"
      },
      {
        "description": "Fixed display issue for shortcuts with certain keybinds (macOS)",
        "issue": 2189
      }
    ],
    "features": [
      "Improved light theme",
      "Changed split view button icon",
      "Added reordering mode to workspaces",
      "Added button to disable all active Zen Mods",
      "Workspace icon picker now supports all emojis by default"
    ]
  },
  {
    "version": "1.0.1-a.12",
    "date": "19/10/2024",
    "workflowId": 11419764479,
    "extra": "This release is a small release that fixes some annoying bugs, and adds some small improvements.\n\nThese releases will commonly mostly contain bug fixes and small improvements as our current goal right now is to stabilize the browser.\n\nThanks everyone for the feedback!",
    "features": [
      "Fixed always rendering the split view overlay, potentially fixing huge speed issues",
      "Disabled 'all' webrender options by default, performance increase for unsupported GPUs"
    ],
    "fixes": [
      {
        "description": "Fixed tab overflow changing the height of the web view"
      },
      {
        "description": "Fixed 'cancel' button for workspaces creation not working"
      },
      {
        "description": "Creating tabs won't flash-bang the user anymore"
      },
      {
        "description": "Fixed tabs moving not closing expand on hover sometimes"
      }
    ]
  },
  {
    "version": "1.0.1-a.13",
    "date": "27/10/2024",
    "workflowId": 11540529505,
    "extra": "This update brings custom gradient themes to workspaces!",
    "features": [
      "Added option to set New Tab button under the last open tab",
      "Disabled support for Kyber KEM by default",
      "Added color picker to generate gradient themes",
      "Added option to give individual workspaces a gradient theme",
      "The amount of maximum web panels is now a preference in about:config"
    ],
    "fixes": [
      {
        "description": "Closing the last pinned tab causes a new tab to open",
        "issue": 2249
      },
      {
        "description": "Fixed moving workspace to end of list and auto disable workspace reordering mode",
        "issue": 2209
      },
      {
        "description": "Fixed split view sliders not showing unless reordering mode is enabled",
        "issue": 2269
      },
      {
        "description": "Fixed malformed XUL for some themes, not showing on the preferences page"
      },
      {
        "description": "Fixed keyboard shortcuts for 'Shift + [N]' not working"
      },
      {
        "description": "Fixed Sidebar \"Expands Tabs on Hover\" option randomly resets to \"Don't Expand Tabs by Default\"",
        "issue": 2156
      }
    ],
    "breakingChanges": ["Removed Show Expand Button option from settings"],
    "themeChanges": [
      "The variable '--zen-main-browser-background' will now contain the generated gradient",
      "Added the 'unread' attribute for background tabs that haven't been accessed yet"
    ]
  },
  {
    "version": "1.0.1-a.14",
    "date": "27/10/2024",
    "workflowId": 32129331813,
    "extra": "This release is a small patch to fix some issues that were introduced in the previous release. Thanks everyone for the quick feedback!",
    "fixes": [
      {
        "description": "Fixed gradient generator not allowing closing the last color"
      },
      {
        "description": "Fixed the gradient generator not saving the texture if it's 0"
      },
      {
        "description": "Fixed transparent colors when not having any color selected"
      },
      {
        "description": "Fixed sidebar webpanels being in a darker contrast"
      }
    ],
    "features": [
      "Added a confirmation dialog when the gradient generator has successfully saved the gradient"
    ]
  },
  {
    "version": "1.0.1-a.15",
    "date": "31/10/2024",
    "workflowId": 11600705444,
    "extra": "This release introduces Zen Glance, a new convenient way to preview links!\n\nZen Glance allows you to open a link preview in a small window, without leaving the current page. This feature is perfect for quickly checking links without losing your place.\n\nWe've also updated to the latest stable version of Firefox (what a mess, everything got broken!), and we can already start to see some early stages of tab groups!\n\nStart using Zen Glance today my 'ctrl+click' or 'alt+click' on macos on any link and experience this new way of browsing!",
    "fixes": [
      {
        "description": "Fixed gradient theme not applying to sidebar using expand on hover",
        "issue": 2360
      },
      {
        "description": "Fixed color picker not being responsive to cursor",
        "issue": 2350
      },
      {
        "description": "Fixed toolbar not using gradient colors when in compact mode"
      },
      {
        "description": "Fixed display issue with titlebar buttons (macOS)"
      },
      {
        "description": "Allow installing unsigned Firefox addons",
        "issue": 2258
      },
      {
        "description": "Fixed glitch when quickly moving multiple tabs"
      },
      {
        "description": "Fixed website permission popups not displaying",
        "issue": 2093
      },
      {
        "description": "Fixed connection errors when using OCSP"
      },
      {
        "description": "Possibly fixed blurry font",
        "issue": 2375
      },
      {
        "description": "Fixed workspace button moving on hover if not shown as strip",
        "issue": 2413
      }
    ],
    "breakingChanges": ["Changed the default layout of the customizable UI buttons"],
    "features": [
      "Added Zen Glance!",
      "Updated to the latest stable version of Firefox (132.0)",
      "Enabled Captive Portal Detection by default",
      "Added polyhedral optimizations to macOS builds",
      "Added preferences to allow having toolbar/sidebar colored with background color, independently",
      "Added support for workspace-theme specific accent colors"
    ]
  },
  {
    "version": "1.0.1-a.16",
    "date": "31/10/2024",
    "workflowId": 11603948220,
    "extra": "This release is a small patch to fix some issues that were introduced in the previous release. Thanks everyone for the quick feedback!",
    "fixes": [
      {
        "description": "Fixed infinite width toolbar when bookmarks bar was open"
      },
      {
        "description": "Fixed disabling 'show newtab button under last active tab' not hiding the button"
      },
      {
        "description": "Fixed wrong alignment on glance action buttons"
      }
    ]
  },
  {
    "version": "1.0.1-a.17",
    "date": "01/11/2024",
    "workflowId": 11620213140,
    "extra": "This was another release with the sole purpose of fixing some issues that were introduced in the previous release. Thanks everyone for the quick feedback!",
    "fixes": [
      {
        "description": "Fixed compact mode sidebar breaking when open a link from the other subpanels",
        "issue": 2218
      },
      {
        "description": "Allow glance meta key only for macos",
        "issue": 2429
      },
      {
        "description": "Fixed changing activation method not applied to tabs",
        "issue": 2429
      },
      {
        "description": "Fixed bookmarks toolbar overflowing the top panel",
        "issue": 2434
      },
      {
        "description": "Fixed height changing when having too many tabs"
      },
      {
        "description": "Fixed Workspace icon jumping in sidebar if not in strip mode",
        "issue": 2413
      }
    ],
    "features": [
      "Glance will now be in a single tab, meaning transitioning from glance to full tab will be seamless",
      "Added escape key for glance",
      "Glance will now be displayed as a little icon next to the active tab"
    ]
  },
  {
    "version": "1.0.1-a.18",
    "date": "09/11/2024",
    "workflowId": 11758612771,
    "extra": "This release brings some quality of life improvements and new features to Zen Browser! First thing you would notice, pinned tabs look like normal tabs now. Why? Because we added 'essentials'.\n\nEssentials are a new way to manage your tabs, workspaces and pinned tabs. You can now have pinned tabs your workspace, and essentials will be the only tabs that are not workspace specific.\n\nWe've also started to experiment with new layouts and designs for the browser, and we've added a more native look to the browser!",
    "features": [
      "Color picker colors will now appear where the mouse has been clicked",
      "Added a workspace indicator that will show the workspace name and icon",
      "Created the first version of Zen Essentials!",
      "Added support for forward/backward mouse buttons for switching workspaces",
      "Pinned tabs and essentials will stay active in all windows",
      "For macos, the browser will now have a transparency/blur factor, based on the theme's contrast. Giving a more native look to the browser",
      "Improved UI theme colors generation and newtab alignment",
      "Default border radius will be OS specific, giving a more native look to the browser",
      "Added weather widget to the newtab",
      "Updated to the latest stable version of Firefox (132.0.1)",
      "Modified auto-detected colors to provide a more consistent experience",
      "Hide the workspaces icons when there's only one workspace",
      "Changed glance looks slightly",
      "Glance tabs will now appear as a small square next to the parent tab",
      "Added option to show newtab button at the top of normal tabs",
      "Added option to add/remove newtab button separation border",
      "Added touch pad gestures for switching workspaces"
    ],
    "fixes": [
      {
        "description": "Fixed release notes link being broken on some places"
      },
      {
        "description": "Fixed shadow offset, making the webview look weird on the left side"
      },
      {
        "description": "Fixed closing glance when there was only one tab left"
      },
      {
        "description": "Fixed custom color input accepting every possible value"
      },
      {
        "description": "Fixed glance buttons not having any background on hover"
      },
      {
        "description": "Fixed urlbar styling inconsistencies, some buttons had offset padding"
      },
      {
        "description": "Fixed having glance on pinned tabs"
      },
      {
        "description": "Fixed opening panel animation, making the popup view look weird while animating"
      },
      {
        "description": "Fixed web panels being reloaded when unpinning them"
      },
      {
        "description": "Fixed not making a default workspace when creating a new profile on specific conditions"
      },
      {
        "description": "Fixed being able to unload splitted tabs",
        "issue": 2236
      },
      {
        "description": "Fixed having a duplicate new-tab button when creating new profiles"
      },
      {
        "description": "Fixed files being downloaded into a temp folder"
      },
      {
        "description": "Fixed opening glance inside a previous glance window, leaving the background transparent"
      },
      {
        "description": "Fixed issues causing intermittent video playback problems on some sites"
      },
      {
        "description": "Fixed an issue causing themes to reset to default after restarting"
      },
      {
        "description": "Fixed not updating workspace name in sidebar when saving"
      },
      {
        "description": "Fixed using the wrong macos window vibrancy material"
      },
      {
        "description": "Fixed custom colours doubling and colour dots getting pulled from other spaces"
      },
      {
        "description": "Fixed glance changing to the next tab if the current tab isn't the last one",
        "issue": 2526
      },
      {
        "description": "Fixed compact mode background being possibly transparent if the custom colors allow it"
      },
      {
        "description": "Fixed not having any background if the workspace hasn't gotten a color yet"
      },
      {
        "description": "Fixed texture slider not working",
        "issue": 2711
      },
      {
        "description": "Fixed white flash when navigating popups",
        "issue": 2438
      },
      {
        "description": "Fixed some translations issues"
      },
      {
        "description": "Fixed workspaces buttons scaling down when being clicked"
      }
    ],
    "breakingChanges": [
      "Changed default layout of the browser, you might want to reset your layout to default",
      "Disabled experimental webview border radius for macos users until we fix the font display issues"
    ],
    "themeChanges": [
      "Compact mode will now use '--zen-main-browser-background-toolbar' as the background color",
      "Browser background isn't defined on zen-main-app-wrapper element anymore but on the #browser element",
      "Added a new variable for the translucency of the browser in macos"
    ]
  },
  {
    "version": "1.0.1-a.19",
    "date": "10/11/2024",
    "workflowId": 11767769200,
    "extra": "This release is a small patch to fix some issues that were introduced in the previous release. Thanks everyone for the quick feedback!",
    "fixes": [
      {
        "description": "Fixed inconsistent resize cursors in split view resize mode",
        "issue": 2252
      },
      {
        "description": "Fixed having a glance tab over an essential tab"
      },
      {
        "description": "Fixed restoring pinned tabs when using private browsing"
      },
      {
        "description": "Fixed not being able to remove sidepanel button from the toolbar",
        "issue": 2792
      },
      {
        "description": "Fixed support URLs pointing to a 404 pages"
      },
      {
        "description": "Fixed extra all-tabs and newtab buttons not appearing on customized toolbar"
      },
      {
        "description": "Fixed workspaces indicator appearing when workspaces are disabled"
      },
      {
        "description": "Fixed compact mode toolbar being active when the sidebar is open"
      },
      {
        "description": "Workspaces indicator will show the first letter of the name if there's no icon in collapsed mode"
      },
      {
        "description": "Fixed sidebar moving the website when having expand on hover enabled"
      },
      {
        "description": "Fixed closing glance not unloading the site, causing memory leaks"
      }
    ],
    "features": [
      "Made essential tabs a bit smaller and more transparent",
      "Changed glance looks and animations",
      "You can now click on the workspace indicator to open the workspaces panel",
      "Add workspace switching by scrolling sidebar",
      "Added a max height to pinned tabs, making it less intrusive",
      "Made workspace indicator stand less out"
    ]
  },
  {
    "version": "1.0.2-b.0",
    "date": "10/12/2024",
    "workflowId": 12246343549,
    "extra": "This release introduces a new stage for Zen Browser, the beta stage! This means that we are getting closer to a stable release, and we are now focusing on fixing bugs and improving the overall experience.\n\nWe've made some significant changes to the UI, including a new layout for the browser called single toolbar and much more!",
    "fixes": [
      {
        "description": "Various fixes in version 20"
      },
      {
        "description": "Fix pinned tab state and favicon handling",
        "issue": 2853
      },
      {
        "description": "Prevent pins deletion from database on non explicit tab closes (window closing)",
        "issue": 2875
      },
      {
        "description": "Fix inconsistent cursor when resizing split view",
        "issue": 2252
      },
      {
        "description": "Fixed changing essential tab when switching workspaces"
      },
      {
        "description": "Fixed restoring pinned tabs to their pinned URLs on startup if the option is checked",
        "issue": 2817
      },
      {
        "description": "Prevent creating new window for dragging pinned tab out of the window."
      },
      {
        "description": "Fixed handling container-specific essentials (now available)"
      },
      {
        "description": "Fixed right-side sidebar on compact mode occupying the screen space"
      },
      {
        "description": "Fixed some titlebar buttons not covering full height"
      },
      {
        "description": "Fixed bug where a popup window would not close/open a new tab"
      },
      {
        "description": "Fixed switching workspaces with the mouse wheel being sluggish"
      },
      {
        "description": "Fixed weird layouts in very specific conditions on macos"
      },
      {
        "description": "Fixed HTTP pacing requests for improved performance"
      },
      {
        "description": "Fixed windows mica titlebar disappearing"
      },
      {
        "description": "Fixed random 'null's appearing for macos users"
      }
    ],
    "features": [
      "New branding and logos!",
      "Updated zen glance animations for smoother transitions and adjust timing (Still in development)",
      "Add reset to pinned URL button to pinned tabs",
      "Made the URL bar background more rounded",
      "Updated to Firefox 133.0",
      "Added support for -moz-gtk-csd-reversed-placement on Linux",
      "Enhance workspace deactivation styles with grayscale filter for better visibility",
      "Windows and linux ARM64 builds are now available on the github for testing!",
      "Hide container label when URL bar is narrow",
      "Macos ARM64 builds will now ship with PGO, performance increase!",
      "Added different layouts for zen: single toolbar, multiple toolbars, and no toolbar",
      "The URL bar will now be floating on the top of the page",
      "Added native mica support for Windows 11",
      "Added hiding window controls support",
      "Created new animations for glance",
      "Added context aware animations for workspace switching",
      "New onboarding experience for new users!",
      "Started experimenting with horizontal tabs"
    ],
    "breakingChanges": [
      "Urlbar now will open when clicking on it instead of on-mousedown",
      "Changed default glance opening trigger to 'alt+click' on linux/windows systems",
      "Removed collapsible sidebar expanding on hover (mod will be available soon). This is due to the difficulty of maintaining it as we evolve the sidebar"
    ]
  },
  {
    "version": "1.0.2-b.1",
    "date": "11/12/2024",
    "workflowId": 12280896272,
    "extra": "This release brings some commong bug fixes and improvements to the browser. Thanks everyone for the feedback!",
    "fixes": [
      {
        "description": "Fixed weird top-bar when mica is enabled with windows 11 accent color enabled"
      },
      {
        "description": "Fixed the urlbar being infinitely long"
      },
      {
        "description": "Fixed weird placement of macos window controls when having multiple toolbars enabled"
      },
      {
        "description": "Fixed dead links in the preferences page"
      },
      {
        "description": "Fixed an 'all-tabs' buttons appearing always and not being able to remove it"
      },
      {
        "description": "Fixed overlapping top toolbar in compact mode when having multiple toolbars enabled"
      },
      {
        "description": "Fixed gradient generator overflowing the dialog on some displays"
      }
    ],
    "features": [
      "Added a preference to disable the new floating URL bar (May be open to bugs, the preference is used as a deprecated feature)",
      "Added new and better compact mode animations",
      "Hide top-buttons when they are empty, preventing having a huge space in compact mode"
    ]
  },
  {
    "version": "1.0.2-b.2",
    "date": "15/12/2024",
    "workflowId": 12333272353,
    "extra": "This release is a small patch to fix some issues and improve overall stability. Thanks everyone for the feedback!",
    "fixes": [
      {
        "description": "Fixed compact mode options not showing when using multiple toolbars"
      },
      {
        "description": "Fixed top-toolbar being overlapped by tabs sidebar in compact mode"
      },
      {
        "description": "Fixed macos window control when changing right side tabs to normal tabs"
      },
      {
        "description": "Fixed compact mode overlapping site when having bookmarks bar enabled"
      },
      {
        "description": "Fixed entering into customize mode while having collapsed tabs"
      },
      {
        "description": "Fixed compact mode not working when only having toolbar hidden in single sidebar layout"
      },
      {
        "description": "Fixed exiting compact mode with right sidebar for windows"
      },
      {
        "description": "Fixed weird shadows and sidebar resize splitter showing when collapsed sidebar"
      },
      {
        "description": "Fixed private mode indicator overflowing collapsed sidebar"
      },
      {
        "description": "Hide label in zen-workspaces when sidebar is not expanded"
      },
      {
        "description": "Fixed clicking on the URLbar suggestions not performing any actions"
      }
    ],
    "features": [
      "Added new sidebar animation when entering compact mode",
      "Updated to firefox 133.0.3",
      "Added the very requested, very needed, feature rich, blazingly fast, innovative URL bar option we had in previous versions",
      "Added an option to only have a floating URL bar when typing (default, please check look and feel settings)",
      "Added a new animation when creating a new tab",
      "Added the collapse/expand sidebar keyboard shortcut",
      "Added new URL bar suggestions UI"
    ]
  },
  {
    "version": "1.0.2-b.3",
    "date": "19/12/2024",
    "workflowId": 12419745635,
    "extra": "This release brings more bug fixing and overall stability while also including some small polishing features/details. Our goal during the beta phase is to get everything as stable and ready for our stable release!\n\nNote: We will be hosting a hall-of-fame event, where top 20 zen rices will be featured in the website!\n\nMerry Christmas everyone!",
    "fixes": [
      "Fixed workspaces not being initialized correctly when creating a fresh profile",
      "Fixed gradient generator not being correctly initialized on startup",
      "Fixed moving around/reordering pinned and essential tabs not saving",
      "Fixed pinned tabs and essential tabs not being saved correctly on the first run of a fresh profile",
      {
        "description": "Fixed compact mode preferences page having wrong labels",
        "issue": 3885
      },
      "Fixed scroll direction when swiping workspaces with mousepads",
      "Fixed weird margins in compact mode in certain conditions",
      {
        "description": "Fixed trying to unload multiple tabs at once",
        "issue": 3831
      },
      "Fixed surrounding spaces for certain layouts while using the web panels sidebar",
      "Fixed workspace indicator showing if workspaces are disabled",
      "Fixed URL bar not showing while in compact mode + right sidebar",
      "Fixed clicking on the URLbar not doing anything on some conditions",
      "Fixed accessibility issues with system links",
      "Fixed bookmarks toolbar being reset when changing toolbar layouts",
      "Fixed having right side floating URL bar opening in single toolbar",
      "Fixed not being able to click on window buttons when having collapsed sidebar on the right",
      "Fixed opening unfloatable URL bar when having compact mode having a weird behavior",
      "Fixed not saving essential tabs correctly, leading to data loss"
    ],
    "features": [
      "Added a 'Copy current URL' keyboard shortcut",
      "Enhanced URL bar layout when it's not floating",
      "Improved and polished compact mode switching animation (Can be disabled in about:config or when having performance issues)",
      "Added delays when hovering on the window buttons, making it a bit less error-prone",
      "Added experimental rounded corners for website (Disabled by default on macos)",
      "Added fallback cache-based website favicon in case we fail to fetch the website's favicon for essentials/pinned tabs",
      "Added a more optimized version of zen hardening, there should be less performance issues now and less font-rendering issues",
      "Added a smoother scrolling experience by using msd physics and changing scroll values/offsets (Disabled in macos)",
      "Optimized workspace switching animations"
    ]
  },
  {
    "version": "1.0.2-b.4",
    "date": "22/12/2024",
    "workflowId": 12453824612,
    "extra": "This release includes many more bug fixes and improvements to the browser. We've also added an <a href='https://github.com/zen-browser/desktop/tree/dev/docs/issue-metrics' target='_blank'>issue metrics</a> file too see how many issues we've fixed each month!",
    "fixes": [
      "Fixed fullscreen notice having a weird animation",
      "Fixed workspace indicator not hiding if the config is set to hide it",
      "Improved accessibility for links on some native system pages",
      "Fixed toolbar buttons disappearing if the window is too small",
      "Fixed compact mode getting stuck when clicking on a pinned tab",
      {
        "description": "Fixed opening customizable toolbar while having multiple windows",
        "issue": 3819
      },
      {
        "description": "Fixed glance not working on sites that prevented click event to happen",
        "issue": 2480
      },
      "Fixed compact mode animations on hover for macos, having laggy window buttons and splitter size for macos",
      "Minor fixes to layout spacing and padding",
      {
        "description": "Fixed URL bar being outside of the window in compact mode while typing",
        "issue": 3913
      },
      {
        "description": "Fixed tab context menu not working when changing tab to a different workspace",
        "issue": 2963
      },
      {
        "description": "Fixed fullscreen videos having a top-bar on certain layouts",
        "issue": 3269
      },
      {
        "description": "Fixed wrong firefox version when using extensions API, therefor breaking some extensions",
        "issue": 1366
      }
    ],
    "features": [
      "Adjust mouse wheel delta multiplier for improved scrolling sensitivity",
      "Disable Normandy studies by default",
      "Zen Mods will now not load if the browser is opened in safe mode",
      "Removed permission buttons in the URL bar into an unified button, saving space (single toolbar layout)",
      "Added support for function keys in the range of F13-F24, also for num lock and scroll lock keys",
      "Add experimental window controls preference to hide the window controls always (zen.view.experimental-no-window-controls)",
      "Fixed and improved PGO, LTO and clang plugins for all builds, improving performance"
    ],
    "breakingChanges": [
      "Due to a high amount of complaints, we've changed the 'Inspect Element' shortcut to 'Ctrl+Shift+L' (Windows/Linux) and 'Cmd+Opt+I' (macOS). This is done to prioritize the 'Copy current URL' shortcut",
      {
        "description": "Removed optimized builds for linux and windows",
        "link": "https://github.com/zen-browser/desktop/wiki/Why-have-optimized-builds-been-removed%3F"
      }
    ]
  },
  {
    "version": "1.0.2-b.5",
    "date": "26/12/2024",
    "workflowId": 12481117227,
    "extra": "This release is just a small patch to fix a really annoying issue with extension popups not working correctly.",
    "fixes": [
      {
        "description": "Fixed compact mode staying open when toggling while having a popup open"
      },
      "Fixed extension popups not multiplying their height every time they are opened"
    ],
    "breakingChanges": [
      "Disabled firefox's login manager by default, because safer alternatives are available. Can be enabled again in the preferences"
    ]
  },
  {
    "version": "1.6b",
    "extra": "This new release includes more polishing changes and bug fixes. We are most excited about our latest release schedule. We are now using Firefox's Release Candidates for Twilight, meaning we can test out new Firefox versions before they are released to the public. This will allow us to fix any issues before they are released to the public.\n\nIt may be a bit late, but happy new year! We hope you have a great year ahead!",
    "fixes": [
      "Fixed compact mode sidebar not hiding fully on some occasions",
      "Fixed context menu checkbox icon alignment for Windows users",
      "Fixed having multiple windows displaying the wrong essentials at startup",
      {
        "description": "Fixed toolbar jittering when in compact mode",
        "issue": 3916
      },
      {
        "description": "Fixed grain texture not being clipped at window corners",
        "issue": 2942
      },
      {
        "description": "Fixed arrow keys not working after opening an extension popup",
        "issue": 2743
      },
      "Fixed wrong window buttons when opening customize toolbar in compact mode",
      {
        "description": "Fixed animation for opening popups cliping their content",
        "issue": 4050
      },
      {
        "description": "Fixed weird coloring for toggle inputs",
        "issue": 4047
      },
      "Update application identifier for Zen Browser to align with new naming conventions (MacOS)",
      "Fixed translations trying to be overridden on Windows builds",
      {
        "description": "Fixed web panels closing and immediately opening again when clicking on the toolbar button",
        "issue": 4049
      },
      "Fixed issues when building PGO, leading to bad optimization techniques",
      "Fixed empty separations not appearing at the top toolbar",
      "Fixed the spacing between the titlebar window buttons and toolbar buttons in MacOS",
      "Fixed support for scrolling vertical tabs when opening a background tab",
      {
        "description": "Fixed mod default preferences not displayed correctly until reopening the settings page or browser restart",
        "issue": 3887
      },
      {
        "description": "Fixed changing mod string preferences sometimes results in missing characters",
        "issue": 3558
      },
      {
        "description": "Fixed on-boarding search engine icons having large sizes",
        "issue": 3575
      },
      {
        "description": "Fixed preferences sidebar hiding on smaller screens",
        "issue": 4051
      },
      "Fixed coloring issue on tree elements such as search engine selection on the preferences page",
      "Fixed pinning and unpinning extensions messing up the toolbar",
      {
        "description": "Fixed duplicating a tab showing the default workspace container indicator",
        "issue": 4132
      },
      {
        "description": "Fixed common issues on the on-boarding pages such as button backgrounds and spacing",
        "issue": 4035
      },
      "Fixed visibility issues when selecting multiple essentials",
      "Fixed syncing workspaces on some specific scenarios",
      "Fixed glance buttons not being able to be clicked",
      "Fixed horizontal spacing issues when using split views",
      {
        "description": "Fixed naming issues between sidebar and web panels",
        "issue": 4043
      },
      "Fixed moving pinned tabs into the essential tabs container breaking the UI",
      "Fixed compact mode not opening when hovering on the side when the window changes size",
      "Improved security for Zen Mods, only allowing installs from the Zen Mods website",
      "Fixed the completely broken save bookmark dialog",
      "Fixed and improved the grain texture for workspace backgrounds (Thanks to @different55)",
      "Fixed zen's app bundle ID giving an incorrect identifier",
      "Fixed issue related to changing workspace with the 4 / 5 mouse buttons and we now take into consideration natural scrolling",
      "Fixed some website dialogs overflowing the window",
      "Fixed moving around pins not saving their position after a restart",
      {
        "description": "Fixed extension Pin to Toolbar overlaid with gtk theme toggle",
        "issue": 1934
      },
      {
        "description": "Fixed opening home page instead of newtab when closing the last workspace tab",
        "issue": 3201
      },
      "Fixed essential icon not appearing on the context menu",
      "Fixed accessibility issues on some native links",
      "Fixed compact mode not closing when opening an extension dialog pinned to the sidebar",
      "Fixed windows 11 titlebar looking weird when having a custom accent color",
      "Fixed workspaces icons appearing on private mode once opening another window",
      {
        "description": "Fixed having invalid shortcuts hard-locking the user inside the loading screen",
        "issue": 4071
      },
      "Fixed weird UI when dragging essentials around, making them look like they are clipping out of the view",
      "Fixed compact mode sidebar flashing for some seconds when opening a glance window"
    ],
    "features": [
      "Updated to firefox 134.0",
      "Added transitioning when changing between workspaces backgrounds",
      "Browser background now goes grayscale when unfocused",
      "Added support for Windows 11 setting 'Show accent color on window title bars and borders'",
      "Enabled experimental features for twilight builds",
      "Improved design of native zen dialogs",
      "Re-enabled the default password manager",
      "Improved on-boarding experience for new users",
      "Added support for searching for emojis on the workspace icon picker",
      "Added support for MacOS smart cards",
      "Installed mods will now be correctly ordered in the settings page",
      "Color picker dialog will now convert to a valid color if it's hex-like but invalid",
      "Made workspace switching tab's animation smoother",
      "Added developer tools shortcuts support!"
    ],
    "breakingChanges": [
      "Changed versioning scheme to match Firefox's Release Candidates",
      "Removed option to disable workspaces. Workspaces are now a core feature of Zen, and it can be really easy to ignore them (they are hidden if you have just one workspace) if you don't want to use them. Most of Zen's functionality is built around workspaces, so we decided to make them a core feature. They were an option before because they were experimental."
    ],
    "workflowId": 12700507897,
    "date": "07/01/2025"
  },
  {
    "version": "1.7b",
    "extra": "This is a small update, but it brings some nice improvements to the workspace and the overall experience.\n\n<strong><u>IMPORTANT FOR FLATPAK USERS</u>:</strong> The app id has changed, please see <a href='https://www.reddit.com/r/zen_browser/comments/1i2cspi/comment/m7di8z1/' target='_blank'>this post</a> for instructions on how to migrate",
    "fixes": [
      "Fixed wrong spacing when using right side tabs",
      {
        "description": "Fixed URL bar being below the tabs visually",
        "issue": 4276
      },
      "Fixed the browser not closing when the last tab is closed (and the preference is set)",
      "Fixed keyboard shortcuts being restarted on startup, saying they are corrupted",
      {
        "description": "Fixed unfocusing the browser with `widget.gtk.rounded-bottom-corners.enabled` causes the bottom corners to stop being rounded",
        "issue": 4294
      },
      {
        "description": "Fixed a small border being visible at the top of the window",
        "issue": 4264
      },
      "Fixed compact mode not closing sometimes if the mouse is moved too fast",
      "Fixed essentials not re-appearing when multiple windows are closed at the same time",
      "Fixed spacing when a workspace doesn't have any icons"
    ],
    "features": [
      "Updated to firefox 134.0.1 (Fixes the YouTube issue!)",
      "New workspace behavior when closing tabs, it's more customizable now",
      "Improved workspace transitioning, giving it a more realistic and smooth feel",
      "Made context switching animations context aware, making them more intuitive",
      "Improved glance animations",
      "Compact mode now has a better opening transition and compact mode sidebar has a small delay when closing",
      "Essential tabs now have the favicon as the background",
      "Enabled full LTO for windows and linux builds (speed and size improvement)",
      "Added support for better UI in rounded corners, giving a more native feel to the app",
      "Fixed paddings on the sidebar if the element-separation is too small"
    ],
    "breakingChanges": [
      "MacOS users default toolbar layout has the webpanels button removed",
      "Disabled smooth scroll on tabs by default (like it was in previous versions)",
      "Changed flatpak id from 'io.github.zen_browser.zen' to 'app.zen_browser.zen'"
    ],
    "workflowId": 12794695928,
    "date": "14/01/2025"
  },
  {
    "version": "1.7.1b",
    "extra": "<u>We are back again with yet another stability update!</u>\n\nThis update focused on finally fixing the main issues people have with essentials/pinned tabs and improving the experience and UI.\n\nWe've improved the browser's overall UI and feel, added new optimized and *bouncy* animations, made some quality-of-life improvements, and are having a great time!\n\nOne thing to expect in future releases is the implementation of a new settings window, where all Zen-specific features can be easily customized and toggled.",
    "fixes": [
      "Fixed essentials and pinned tabs not being correctly restored when using multiple windows",
      "Fixed bookmarks failing to correctly initialize when using multiple windows",
      "Fixed 1password always prompting for password with the message 'It looks like Firefox has been updated'",
      "Fixed macos users having all toolbar buttons on the right side",
      "Fixed having one extra pixel on the web views, leading to weird UI",
      "Refactored overall UI and spacings",
      "Fixed unloading tabs still taking up memory",
      "Fixed essentials being deleted when closing the last window",
      "Fixed split views leading to weird margins",
      "Fixed the sidebar thinking the mouse is over them when it's not",
      "Workspaces no longer run into problems caused by timing issues. This means a big improvement in reliability, especially when using multiple windows or processes at the same time",
      "Fixed unloading tabs while having the devtools open",
      "Fixed essentials trying to duplicate them before all windows have been restored",
      "Fixed weird margins when using the web panels",
      "Fixed animations when trying to switch workspaces but no other workspace exists",
      "Fixed dialogs having bad contrast on some themes",
      "Fixed the sidebar thinking it's being hovered when opening the URL bar"
    ],
    "features": [
      "Made compact mode individual for each window",
      "New shadows, colors, fonts, spacing and animations!",
      "Pinned tabs wont have a scrollbar (or max height) anymore unless it covers 90% of the screen",
      "Compact mode delay before closing has been reduced",
      "New compact mode animations and feel",
      "Made the sidebar icons overflow! Meaning the size wont matter anymore on the number of top icons",
      "Tweaked values for windows to provide a more native feel"
    ],
    "breakingChanges": [
      "Changed default setting for 'Essentials favicon in background' to false, These settings will be better handled once we have a customized settings page (toggle <strong>zen.theme.essentials-favicon-bg</strong> in <strong>about:config</strong> to change it back)",
      "Changed the about:config 'close window with last tab' default value to false"
    ],
    "workflowId": 12858147265,
    "date": "19/01/2025"
  },
  {
    "version": "1.7.2b",
    "extra": "Another stability update, where we've fixed a few more bugs and improved the overall feel of the app.\n\nThis is a small update, released primarily to keep Firefox up to date while we work on the next big update.",
    "fixes": [
      "Fixed firefox sidebar spacings",
      "Fixed compact mode rounded corners",
      "Fixed native fonts for windows and linux",
      "Fixed sidebar hiding icons when they could easily fit",
      "Fixed native rounded corners for each OS",
      "Fixed an error when opening zen when having compact mode enabled",
      "Fixed glance messing up with tabs after being closed",
      "Fixed workspaces not initializing when the button is missing from the toolbar"
    ],
    "features": [
      "Update Firefox version to 134.0.2",
      "Improved glance animations",
      "Glance now opens automatically on essential tabs instead of a new tab",
      "Add dark mode support for dialog box",
      "Essentials/URL bar background is now calculated based on the window color, making it look more blended",
      "Adjusted overall spacings and rounded corners around the browser for a better feel"
    ],
    "workflowId": 12896824615,
    "date": "21/01/2025"
  },
  {
    "version": "1.7.3b",
    "extra": "In this release, more stability and performance improvements have been made.",
    "fixes": [
      "Fixed essentials background having the wrong border radius",
      "Fixed compact mode sidebar not re-opening when the animation key is off",
      "Fixed closing pinned tabs with CTRL+W making the browser unusable",
      {
        "description": "Fixed glance opening on essential tabs even if it's disabled",
        "issue": 4564
      },
      "Fixed crash on overflow menu in macos",
      "Fixed elements shifting on macos fullscreen",
      "Fixed changing entering on customizable mode when having multiple windows",
      "Fixed empty space on top of the vertical tabs when there's no buttons inside it",
      "Fixed having an empty overflow menu when using single toolbar layout",
      "Fixed print dialog not opening and fixed website dialogs being clipped",
      "Fixed keyboard shortcuts not working after pinning extension to the bookmarks bar",
      "Fixed tabs overflowing the browser when closing multiple essential tabs",
      "Fixed visual inconsistency with split view confirmation popup"
    ],
    "features": [
      "Macos users with single toolbar layout will now NOT have the three dots panel button. This is done to decreased used space. Alternatives can be using the macos native menu bar or disabling it with 'zen.view.mac.show-three-dot-menu' in about:config",
      "MacOS builds are now in a single, unified DMG file",
      "Pinned tabs AND normal tabs will now scroll together in order to increase visibility",
      "Glance now has a more native feel to it",
      "Glance will now wait for the answer to 'this page might not save your data' before closing the tab",
      "Better and more consistent workspace transition for touchpad users",
      "Added more native tab border radius",
      "Split view rearrangement now has transition animations",
      "Improved the display of workspace icons in the workspace switcher",
      "New tab animation is now smoother",
      "Increase tab unloader timeout from 20 to 40 minutes",
      "Compact mode doesn't animate if the mouse is already on the sidebar",
      "Made the animation of workspace switching faster and smoother",
      "Add ellipsis to URL bar placeholder text for improved visibility",
      "If the newtab button is at the top, new tabs will be inserted at the top as well"
    ],
    "breakingChanges": [
      "The default newtab position is now at the top (can be disabled in the settings under Look & Feel)",
      "Changed default pinned behavior where it always opens a new tab if only pinned tabs exist"
    ],
    "workflowId": 13053102880,
    "date": "30/01/2025"
  },
  {
    "version": "1.7.4b",
    "date": "30/01/2025",
    "workflowId": 13062083313,
    "extra": "Quick fix for a critical bug that was introduced in the previous release.",
    "fixes": [
      "Fixed the browser not opening when having multiple windows",
      "Fixed macos fullscreen having a weird shadow"
    ]
  },
  {
    "version": "1.7.5b",
    "extra": "Another stability update while we are figuring big changes out!\n\nThis update has been focused on adding some cool new features such as removing the need of new tabs and a better glance experience. We have also fixed a lot of bugs that have been reported by the community, thank you for your feedback!",
    "fixes": [
      "Fixed double clicking the sidebar not opening a new tab",
      "Fixed having tabs for workspace containers not changing containers",
      "Fixed tabs scrolling to the top each time a tab is closed",
      "Fixed 'Switch to workspace where container is set as default when opening container tabs' not working",
      "Fixed sidebar spacings and styling issues",
      "Fixed glance sometimes crashing when opening a new tab",
      "Fixed workspaces switching randomly when closing a tab in certain scenarios",
      "Fixed hard-locks randomly appearing, often due to keyboard shortcuts",
      "Fixed essentials having scrollbar issues",
      "Fixed glance tabs being unloaded",
      "Fixed unloading about: pages making the browser unresponsive",
      "Fixed settings page not displaying correctly some of the shortcut descriptions",
      "Fixed mute button having a broken icon",
      "Fixed bug where container-specific essentials don't remain focused when switching workspaces"
    ],
    "features": [
      "Updated to firefox 135.0",
      "NEW TABS HAVE BEEN REMOVED, instead we are opting for opening the URL bar and then pressing enter to open a new tab ('zen.urlbar.replace-newtab' to false in about:config to revert)",
      "Added the ability to pinning or adding to essentials by simply dragging and dropping",
      "Add thin scrollbar style to vertical tabs for improved aesthetics",
      "Added support for having glance in multiple tabs!",
      "Floating URL bar doesn't show the compact mode sidebar anymore",
      "Added a 'copy current URL as markdown' shortcut",
      "New glance UI and animations",
      "New icons!",
      "Improved workspace switching with gestures"
    ],
    "breakingChanges": [
      "Disabled tab previews by default, can be enabled in settings",
      "We now use the .tar.xz format for the linux release",
      "New tabs have been removed, check the features section",
      "Replaced default toolbar layout, the profile button with the settings icon"
    ],
    "workflowId": 13194954146,
    "date": "05/02/2025"
  },
  {
    "version": "1.7.6b",
    "extra": "This release is a small one, but it brings a few fixes and a new feature.",
    "fixes": [
      "Fixed sidebar icons all looking the same",
      "Fixed floating URL bar making the compact mode appear for some time",
      "Fixed tabs appearing on the pinned tabs section",
      "Fixed middle mouse click on the sidebar not opening a new tab",
      "Fixed notifications not being able to be closed",
      "Fixed URL bar margins when using single toolbar mode",
      "Fixed tabs scrolling to the top constantly",
      "Fixed changing tabs not being scrolled to when overflowing the sidebar",
      "Fixed opening glance tabs on essentials messing up the sidebar",
      "Fixed pinned tabs appearing on normal container after a restart"
    ],
    "features": [
      "Tabs can now be dragged into pinned tabs by dragging them into the workspace indicator"
    ],
    "workflowId": 13209591935,
    "date": "08/02/2025"
  },
  {
    "version": "1.8b",
    "extra": "Huge update filled with improvements and QoL features.\n\nP.S. Check out this cool site! https://doeszenhavedrmyet.com/",
    "fixes": [
      "Fixed weird text generation when rendering PDFs/Google Docs on some websites, without the need to disable hardware acceleration",
      "Fixed glance opening on the wrong location when expanding while opened on a normal tab",
      "Fixed tabs being clipped while dragging with the touchpad",
      "Fixed the floating URL bar hiding while doing IME composition",
      "Fixed transparent URL bar when focusing it on fullscreen",
      "Fixed workspace switching sometimes selecting the wrong previously selected tab",
      "Fixed tabs sharing screens not hiding when switching workspaces",
      "Fixed URL bar glitching when focusing in compact mode",
      "Fixed pinned tabs separator using the wrong tabs when hiding",
      "Fixed rearranging essential tabs containing glance tabs",
      "Fixed normal tabs opening where pinned tabs are after having a glance tab opened",
      "Fixed trying to unload an about:* page rendering the browser useless",
      "Fixed floating URL bar glitching hovering compact mode sidebar",
      "Fixed pinned/essentials tabs being reorganized when opening multiple windows",
      "Fixed renaming/changing icons on some occasions not working",
      "Fixed pinning tabs with glance opened not working",
      "Fixed pinned tabs / essentials opening in the container that the window was opened",
      "Fixed not being able to move around multiple pinned tabs at the same time",
      "Fixed selecting essentials/pinned tabs when switching workspaces",
      "Fixed opening new windows with container specific essentials showing all at once"
    ],
    "features": [
      "🔥 Tabs are handled in different containers, meaning faster transitions and better swiping experience",
      "🔥 Added support for acrylic backgrounds for windows 11 with mica support",
      "🔥 Added a better gradient generator that follows color theory",
      "🔥 Added support renaming pinned tabs",
      "🔥 Added support for a state-less empty tab (only enabled if 'zen.urlbar.replace-newtab' is enabled)",
      "🔥 New, better on boarding experience",
      "Pinned tabs will now have an 'indicator' to reset back to the original URL",
      "Windows users will now be able to watch DRM content (experimental wmfcdm encrypted media, off by default)",
      "Improved URL bar styles, colors and more",
      "Updated to firefox 135.0.1",
      "When opening a new tab with the URL bar, the newtab button is now selected for better understanding",
      "Added a timer setting that states how much the newtab URL bar should wait before clearing it's contents (default is 45 seconds)",
      "Faster initialization of the UI and better initial loading experience",
      "Increased font size for macos users",
      "MacOS users will now have zen display as 'Zen' instead of 'Zen Browser' in the native top bar",
      "Removed 'status alert' green dot from tabs",
      "Added improved and bouncier toast notifications",
      "URL bar is now fully floatable, always at the center of the screen and with better looks",
      "Added an option to completely ignore hovering over the compact mode sidebar ('zen.view.compact.show-sidebar-and-toolbar-on-hover' in about:config)",
      "Improved shadows, borders and corners in common UI elements",
      "Compact mode now also gets texture if any is set",
      "MacOS window buttons are now mono colored (zen.widget.mac.mono-window-controls in about:config)",
      "Add support for additional languages: Welsh, Estonian, Persian, Finnish, Hebrew, and Icelandic",
      "Swiping between workspaces now has a force feedback and a maximum limit",
      "Double clicking on an essential now resets to the original URL",
      "Changed default behavior of the '-' button on pinned tabs to reset, unload and switch the tab"
    ],
    "breakingChanges": [
      "Removed profile switching toolbar button and dialog, now that firefox will release them in their next version",
      "Bottom toolbar has been reset to the default"
    ],
    "workflowId": 13486953635,
    "date": "21/02/2025"
  },
  {
    "version": "1.8.1b",
    "extra": "Small update with some bug fixes and improvements.",
    "fixes": [
      "Fixed updating from older versions not showing tabs from other workspaces at startup",
      "Fixed double-clicking on essentials not restoring their URL",
      "Fixed re-ordering tabs with glance changing locations",
      "Fixed opening the settings page not selecting the tab",
      "Fixed issues where a new profile would be created",
      "Fixed floating URL bar when entering compact mode using double toolbars"
    ],
    "workflowId": 13505992592,
    "date": "24/02/2025"
  },
  {
    "version": "1.8.2b",
    "extra": "Another update with many bug fixes!",
    "fixes": [
      "Fixed pinned tabs re-ordering on startup",
      "Fixed bookmarks not inheriting the container from the workspace",
      "Fixed URL bar in compact mode being clipped by the window",
      "Fixed re-ordering normal tabs not working sometimes",
      "Fixed pinning a tab adding them to the essentials container",
      "Other small fixes for compact mode not animating properly"
    ],
    "features": ["localhost and http URL will no longer be trimmed in single toolbar layout"],
    "workflowId": 13530880093,
    "date": "25/02/2025"
  },
  {
    "version": "1.9b",
    "extra": "Another nice update for Zen! This time, we've added a new feature that allows you to drag-and-drop tabs into the browser to split them!",
    "fixes": [
      "Fixed pinned tabs being subject to appearing on the essentials container",
      "Fixed opening bookmarks on empty tab pages",
      "Fixed automatic Glance opening from the edge of the screen",
      "Fixed background gradients not showing the colors in the correct order",
      "Fixed creating essentials being in the wrong order",
      "Fixed watermark not waiting enough time and startup layout",
      "Fixed reordering tabs not being correctly saved for pinned tabs",
      "Fixed bookmark items not opening",
      "Fixed not hiding empty tab from add-ons, crashing the browser on some cases",
      "Fixed compact mode sidebar animating on an empty state and not animating properly when having the URL bar floating",
      "Fixed expanding glance not opening in the correct position when having container specific essentials",
      "Fixed external links not opening in the correct workspace container",
      "Fixed the AppImage version not being able to set itself as the default web browser",
      "Fixed closing the browser in an empty state opening about:blank on startup",
      "Fixed Linux users crashing when closing the laptop lid",
      "Fixed dragging tabs from different windows crashing the browser if they are from different containers"
    ],
    "features": [
      "Updated to Firefox 136.0",
      "Added support for a drag-and-drop tab split feature that also groups tabs in a nice UI!",
      "Implemented a more complete JPEG XL decoding and OS support, allowing things such as animated images and more",
      "Allow having full URL without https in sidebar (zen.urlbar.show-domain-only-in-sidebar)",
      "Add preference to hide one-off search buttons (off by default, zen.urlbar.hide-one-offs)",
      "Added martial arts emoji to the default emoji set",
      "MacOS users can now control what window material they have (zen.widget.macos.window-material, 1 to 7, default is 2)",
      "Added support to drag-and-drop tabs from other windows while in compact mode",
      "Small changes to padding around the website and URL bar",
      "Favicons should render with better corners now",
      "Did some changes to the default onboarding essentials selection as some people had concerns about them"
    ],
    "workflowId": 13732201436,
    "date": "07/03/2025"
  },
  {
    "version": "1.9.1b",
    "extra": "Another update with stability improvements.",
    "fixes": [
      "Fixed new tabs opening where Essentials are in some cases",
      "Fixed a bug where workspace-specific bookmarks don't work",
      "Fixed re-arranging tabs while having Glance opened",
      "Fixed UI issues with double toolbar in the URL bar icons",
      "Fixed dropping tabs outside of the window not opening the new tab",
      "Fixed session restore not working with closed windows",
      "Fixed compact mode not hiding when minimizing the window"
    ],
    "features": [
      "Added the option to drag-and-drop a tab to the right side of the screen to split",
      "Updated to Firefox 136.0.1",
      "Glance now asks for confirmation before closing if it's focused on an input field"
    ],
    "workflowId": 13799489812,
    "date": "11/03/2025"
  },
  {
    "version": "1.10b",
    "extra": "This small but mighty update includes some exciting new features and improvements to Zen, such as passkey support for MacOS, and a media player controller that's fully integrated with Picture-in-Picture mode.",
    "fixes": [
      "Glance should no longer close if 'onbeforeunload' is triggered",
      "Fixed splitting more than 3 tabs by dragging them to the web view",
      "Fixed unloading pinned tabs that had 'onbeforeunload' listeners",
      "Fixed and tweaked small UI issues with spacing, animations, and more",
      "Fixed toolbars being different sizes and overflowing buttons not hidding when starting the browser",
      "For Wayland users, fixed UI panels being cut off the screen (e.g. install extension panel)",
      "Fixed opening external links not being focused and appearing at the end of the tab list"
    ],
    "features": [
      "Added support for passkeys on MacOS",
      "Added a media player controller that's fully integrated with Picture-in-Picture mode",
      "Updated to Firefox 136.0.2",
      "Added a default favicon for broken site favicons",
      "Better toast notifications UI",
      "Pressing ESC on newtab URL bar will now focus the web view, meaning the input will be fully blurred"
    ],
    "workflowId": 13935735067,
    "date": "18/03/2025"
  },
  {
    "version": "1.10.1b",
    "extra": "A small update with some bug fixes and improvements. We've also added a feature many of you have been asking for: a minimize button for Picture-in-Picture mode!",
    "fixes": [
      "Fixed media player having low contrast on automatic theme",
      "Fixed removing dots on the gradient generator, making more appear when changing the color",
      "Fixed tab unloader asking for confirmation to leave the site before unloading tabs",
      "Fixed drag-to-pin not working on private windows",
      "Fixed overflowing tabs scrolling to the top when the media player is open",
      "Fixed unloaded tabs still taking up memory",
      "Fixed Flatpak users mounting shader cache to the wrong directory"
    ],
    "features": [
      "Added a minimize button to Picture-in-Picture",
      "Workspace icons will now collapse if there are too many overflowing the sidebar",
      "Media player now also accounts for video playback speed modifiers"
    ],
    "workflowId": 13986406867,
    "date": "21/03/2025"
  },
  {
    "version": "1.10.2b",
    "extra": "Just a small update to improve stability while we work on much bigger things like: tab folders, a new workspace management UI, a new settings panel, and more. Sorry!",
    "fixes": [
      "Fixed the media player's playback rate and overflow not being updated correctly",
      "Fixed pinning tabs in private mode making the browser unresponsive",
      "Fixed compact mode and back/forward mouse buttons switching workspaces or not hiding the sidebar"
    ],
    "features": [
      "Updated to Firefox 136.0.3",
      "Split views now persist across restarts",
      "Toasts will now appear on the left when the sidebar is on the right"
    ],
    "workflowId": 14067980701,
    "date": "26/03/2025"
  },
  {
    "version": "1.10.3b",
    "extra": "Terribly sorry for the frequent updates, this emergency release simply updates Firefox, fixing a critical vulnerability in chromium's sandboxing system. You can read more here:\n\n<a href='https://cyberinsider.com/firefox-says-its-vulnerable-to-chromes-zero-day-used-in-espionage-attacks/'>https://cyberinsider.com/firefox-says-its-vulnerable-to-chromes-zero-day-used-in-espionage-attacks/</a>",
    "features": ["Updated Firefox to 136.0.4"],
    "workflowId": 14109635630,
    "date": "27/03/2025"
  },
  {
    "version": "1.11b",
    "extra": "This update brings in some new QoL improvements that we think you'll love, and more stability!",
    "fixes": [
      "Fixed dialogs in Glance tabs shrinking",
      "Fixed Glance opening links that are not http(s) or files (such as magnet links)",
      "Fixed opening Glance tabs while in a split view",
      {
        "description": "Fixed huge performance degradation and high CPU usage when using extensions with the 'tab access' permission",
        "issue": 7057
      },
      "Fixed windows showing Mozilla as Zen's vendor",
      {
        "description": "Fixed opening the certificate manager from the settings",
        "issue": 7083
      },
      "Tab unloader now unloads tabs that are not in the current workspace",
      "Fixed tabs not moving to forced workspaces",
      {
        "description": "Media Playback Continues After Unloading a Pinned Tab",
        "issue": 6995
      },
      "Fixed restoring tabs with split views making the browser not load anything",
      "Fixed other related workspace changing issues"
    ],
    "themeChanges": [
      "Media query '-moz-bool-pref:' has been changed to '-moz-pref()'. This was removed in Firefox 137, but we added support for the old implementation until 138"
    ],
    "features": [
      "Updated to Firefox 137.0",
      "Added support for 'split Glance tab' in the Glance button menu",
      "Added support for Mica context menus and panels",
      "Added support for MacOS native panel backgrounds",
      "Mica and acrylic don't require a restart anymore to take effect",
      "Increased security by following Mozilla's new guidelines for parent process event handling"
    ],
    "breakingChanges": [
      "While we understand some of you used the web panels feature, recent research lead us to completely removing it due to security concerns and difficulties in maintaining it. We recommend using split views instead. We are very sorry for the inconvenience this may cause."
    ],
    "workflowId": 14242192854,
    "date": "03/04/2025"
  },
  {
    "version": "1.11.1b",
    "extra": "This small update brings some nice fixes and stability improvements to Zen",
    "fixes": [
      "Fixed Glance not becoming it's own tab when expanding",
      "Fixed custom colors not persisting across sessions",
      "Fixed compact mode on the right shifting the website to the left"
    ],
    "workflowId": 14277375722,
    "date": "05/04/2025"
  },
  {
    "version": "1.11.2b",
    "extra": "Another stability update for Zen, while we prepare some cool new features for the future! Clue: it starts with an 'F'",
    "fixes": [
      {
        "description": "Fixed the URL bar showing a transparent background after clicking 'Ctrl+T' in a fullscreen video",
        "issue": 6996
      },
      {
        "description": "Fixed the browser breaking shortly after 'Close other tabs",
        "issue": 7459
      },
      {
        "description": "Fixed the opacity of #urlbar element sometimes being overwritten",
        "issue": 7454
      },
      "Fixed flashbangs on Mica context panels",
      "Fixed Firefox sidebar staying on the left permanently",
      "Other fixes to compact mode, Glance and PiP integration with the media player"
    ],
    "features": [
      "Updated to Firefox 137.0.1",
      "Added support for Linux transparency under the `zen.widget.linux.transparency` preference",
      "Added support for drag-and-drop essentials to split 2 tabs together; when pinning a non-pinned tab with a pinned tab, the pinned tab will be duplicated instead of being added into the split view group"
    ],
    "workflowId": 14363153438,
    "date": "09/04/2025"
  },
  {
    "version": "1.11.3b",
    "extra": "We are back with some nice QoL improvements and bug fixes. We decided that the release of Firefox 138 will be the defining moment for Zen, allowing stable enough groups for us to release tab folders! We are also working on something called 'Zen Library'!",
    "fixes": [
      "Fixed Glance occasionally acting weird when cycling tabs with the keyboard",
      "Fixed various animations and generic issues in compact mode",
      "Fixed an incorrect URL bar height when exiting from full-screen videos",
      "Fixed the sidebar being visible in compact mode when opening the floating URL bar",
      "Fixed 'Ctrl+T' occasionally opening on the current tab when pressing 'Ctrl+Enter'",
      "Fixed pinned tabs disappearing after restart when splitting or duplicating them"
    ],
    "features": [
      "On MacOS, you can now cycle through tabs with 'Cmd+Option+UP' or 'Cmd+Option+DOWN'",
      "Blurring the input will now fully un-select the text",
      "Windows binaries are now correctly signed and *should* not be flagged by any antivirus",
      "New media control state for sites using WebRTC, like Discord and Google Meet that allows you to mute/unmute the camera and mic",
      "Added better support for `zen.theme.content-element-separation` being 0 in 'about:config' for different Zen features"
    ],
    "themes": [
      "Added the CSS attribute `-zen-window-transform-origin` for Chrome style sheets to allow for better positioning of the window when animating"
    ],
    "workflowId": 14434223474,
    "date": "14/04/2025"
  },
  {
    "version": "1.11.4b",
    "extra": "This update includes a number of bug fixes and performance improvements!",
    "fixes": [
      {
        "description": "Fixed Glance not working on 'http' or 'file' protocols",
        "issue": 7263
      },
      {
        "description": "Fixed the sidebar scrollbar being innaccessible because it's too thin",
        "issue": 7374
      },
      {
        "description": "Fixed unloaded tabs appearing in the 'Ctrl+Tab' switcher",
        "issue": 7365
      },
      "Fixed split view not opening a new window when dragging the tab outside",
      "Fixed enabling 'Restore pinned tabs to their originally pinned URL on startup' setting not working",
      "Fixed pinned tabs doing a second 'GET' request on startup instead of using a cached version",
      "Fixed Windows packages not containing redistributable files",
      {
        "description": "Fixed 'reset tab' not appearing if only the query parameters changed on the URL",
        "issue": 7614
      },
      {
        "description": "Fixed workspaces temporarily inheriting essential tabs from the source workspace a container tab was switched from",
        "issue": 7295
      },
      {
        "description": "Fixed inconsistent spacing with the native Firefox sidebar on compact mode (multiple toolbars)",
        "issue": 7118
      },
      "Fixed de-selected split views still having the pending attribute",
      {
        "description": "Fixed swiping workspaces with Logitech mouse not working",
        "issue": 7274
      },
      {
        "description": "Fixed a performance issue when closing multiple tabs",
        "issue": 7507
      },
      {
        "description": "Fixed window controls not expanding on split views; and element separation on 0 also not expanding them",
        "issue": 7694
      }
    ],
    "features": [
      "Updated to Firefox 137.0.2",
      "Enabled automatic picture-in-picture by default (`media.videocontrols.picture-in-picture.enable-when-switching-tabs.enabled` in about:config)",
      "Enabled bottom rounded GTK corners on Linux by default"
    ],
    "workflowId": 14525944862,
    "date": "18/04/2025"
  },
  {
    "version": "1.11.5b",
    "extra": "A small update to fix some issues with the new PiP feature and 'element-separation: 0'",
    "fixes": [
      "Fixed an issue with 'element-separation: 0' disallowing access to the window controls",
      "Disabled automatic PiP until we've built a proper settings UI panel of our own"
    ],
    "features": [],
    "workflowId": 14551479492,
    "date": "20/04/2025"
  },
  {
    "version": "1.12b",
    "extra": "A nice update that brings some cool new features and fixes!\n\nWe are also excited to announce that we've joined <a href=\"https://floss.social/@zenbrowser\">floss.social</a>!\n\nIn response to recent privacy concerns, we've significantly strengthened Zen's privacy measures. Previously, we only disabled telemetry, but some minimal pings were still being sent. Now, Firefox telemetry has been completely stripped out from the core.\n\nAdditionally, onboarding pages and initial Essentials favicons are now locally bundled and our website no longer relies on any external services, CDNs, nor Cloudflare services. Initial Essentials selected on startup will only be loaded when the tab is clicked on, so connections won't be established until you explicitly enter the tab. We also changed our onboarding Essentials options to more privacy and productivity focused sites.\n\nOnly critical security updates and other non-telemetry-related services remain. As a result, the number of external connections has dropped from 82 to around 20-10 — factoring in that Zen's site is loaded twice (for the welcome page and privacy policy).\n\nPsst. With the release of Firefox 138, folders are just around the corner!",
    "fixes": [
      "Fixed a crash when no loaded tab is present on the 'Ctrl+Tab' menu",
      {
        "description": "Fixed alert boxes cutting off halfway on split view",
        "issue": 7564
      },
      {
        "description": "Fixed moving split view tabs into other workspaces not working",
        "issue": 7840
      },
      "Fixed 'Paste-And-Go' always navigating in the current tab, even after 'Ctrl+T' is pressed",
      {
        "description": "Panels UI not rendering add-ons correctly, and overflowing outside the screen on Linux",
        "issue": 7633
      },
      "Fixed URL bar unfocusing when pressing the newtab button",
      {
        "description": "Fixed Glance freezing when opening tabs in other workspaces",
        "issue": 7864
      },
      {
        "description": "Fixed duplicating tabs being stuck on 'New Tab' text",
        "issue": 7900
      },
      "Fixed an empty newtab opening when closing with a pinned tab selected on the previous session"
    ],
    "features": [
      "Updated to Firefox 138.0.1",
      "Increased privacy and reduced initial connections at startup",
      "Added a *really smooth* animation when downloading files. Thanks to @BrielOtero on Github!",
      "New, fully containerized Essentials are out! It allows having different Essentials based on your workspace's container. It can be enabled by going into 'about:preferences' -> 'Tab Management' -> 'Enable container-specific Essentials'",
      "Automatic Picture-in-Picture won't activate if the video is muted",
      "Added homepage button and export/import buttons to the mods page for easier access. Thanks to @Pdzly on Github!",
      "More efficient workspace switching, by only animating what we need and warming up the tabs before switching",
      "New looks for the URL bar!",
      "The Essentials layout receives a nice revamp to better use the space",
      "Added a search engine selection form for the onboarding page",
      "Double clicking on the sidebar slider will now reset it's width",
      "Did internal refactoring to certain components in order to comply with Firefox's new security standards."
    ],
    "workflowId": 14803913371,
    "date": "03/05/2025"
  },
  {
    "version": "1.12.1b",
    "extra": "This is just a small update to fix some bugs with the previous version. Please check out the release notes for 1.12b for more details.",
    "fixes": [
      "Fixed sidebar in collapsed and compact modes being too small",
      "Fixed jitter on compact mode on Windows",
      "Fixed duplicate new tabs opening when having 'replace-newtab' disabled",
      "Fixed custom colors being irremovable"
    ],
    "features": [],
    "workflowId": 14812026286,
    "date": "04/05/2025"
  },
  {
    "version": "1.12.2b",
    "extra": "Just a small update to fix some bugs and introduce some minor features!",
    "fixes": [
      "Fixed Essentials/pinned tabs not loading if 'reset to default on startup' is enabled",
      "Fixed the context menu allowing the user to remove the last workspace",
      "Fixed animations for Glance's buttons and unfocusing the URL bar, as well as enter/exit animations for compact mode",
      "Fixed accessibility issues with the URL bar in light mode. Also centered the URL bar to the screen",
      "Fixed some issues with right side tabs on collapsed mode",
      "Fixed some issues with importing mods"
    ],
    "features": [
      "Added a new preference in about:preferences -> 'Startup'. Continue where you left off allows you to keep browsing from your last selected tab, whether it's pinned or not",
      "Enabled 'auto theme' by default, which will automatically switch between light and dark mode based on the system theme. Only new installs and profiles will have this enabled (you can enable it in 'about:addons' -> 'themes')",
      "Added a nice UI for 'switch tab' on the URL bar, thanks to @ferrocyante on GitHub!",
      "(experimental) MacOS users will now restore tabs correctly, even after closing all windows instead of quitting the app",
      "Better toast notifications and added an 'opened background tab' toast if compact mode is enabled"
    ],
    "workflowId": 14870461714,
    "date": "05/05/2025"
  },
  {
    "version": "1.12.3b",
    "extra": "",
    "fixes": [
      "Fixed the toast notifications not aligning when tabs are on the right",
      "Fixed restoring previous tabs not working in some cases",
      "Disabled search suggestions by default. Can be enabled again in 'about:preferences' -> 'Search'",
      "Fixed compact mode always showing that a background tab has been added",
      "Other small fixes and improvements"
    ],
    "features": [],
    "workflowId": 14909673572,
    "date": "08/05/2025"
  },
  {
    "version": "1.12.4b",
    "extra": "",
    "fixes": [
      "Fixed issues with toast notifications not being hidden after a timeout and displaying when they shouldn't",
      {
        "description": "Fixed MacOS close buttons being misaligned on the collapsed sidebar",
        "issue": 7129
      },
      {
        "description": "Fixed the download animation appearing on all windows",
        "issue": 8247
      },
      {
        "description": "Fixed Glance controls appearing on the wrong side when 'Tabs on the Right' was used",
        "issue": 7910
      },
      "Fixed various issues with the URL bar on double toolbar mode",
      "Fixed some issues with restoring the previous session"
    ],
    "features": [
      "Updated to Firefox 138.0.3",
      "For MacOS users, dragging tabs and changing the texture for the workspace's background now provides haptic feedback (zen.haptic-feedback.enabled)",
      "The 'copy current url' toast now displays a share icon (only on Windows and MacOS)",
      "The URL bar can now search through renamed pinned tabs"
    ],
    "workflowId": 15003870178,
    "date": "14/05/2025"
  },
  {
    "version": "1.12.5b",
    "extra": "",
    "fixes": ["A weird shadow with the URL bar.", "'All tabs' button appearing unexpectedly."],
    "features": [],
    "workflowId": 15024223699,
    "date": "14/05/2025"
  },
  {
    "version": "1.12.6b",
    "extra": "This new release updates Firefox to the latest version which fixes various security issues.",
    "fixes": [
      "Compact mode showing 'tab opened in the background' when having multiple toolbars.",
      "An issue with GTK popups having low contrast.",
      "Tabs not being able to unload after closing Glance.",
      "An issue with updating invalid mods clearing the mod list.",
      "An accessibility issue with the scrollbar on the sidebar.",
      "Opening a new link in split view while having Glance open.",
      "'All tabs' menu not showing any text when collapsed toolbar is enabled."
    ],
    "security": "https://www.mozilla.org/en-US/security/advisories/mfsa2025-36/",
    "features": [
      "Updated to Firefox 138.0.4",
      "Better compact mode support for multiple toolbars."
    ],
    "knownIssues": ["Selecting a tab on private mode doesn't scroll to make the tab visible."],
    "themeChanges": [
      "Changed the layout of workspaces and their icons internally to provide a more stable layout that doesn't require floating elements. We finally managed to get it to how we wanted it to be, so it will change less in the future."
    ],
    "breakingChanges": [
      "The customizable UI on the tab strip (located between the top and bottom icons) has been discontinued due to the way the internal layout functions—buttons placed in that area are automatically removed. While it’s possible to re-enable this feature by doing some hacky CSS, doing so may lead to instability or breakage, and is not officially supported."
    ],
    "workflowId": 15130878592,
    "image": false,
    "date": "19/05/2025"
  },
  {
    "version": "1.12.7b",
    "extra": "",
    "fixes": [
      "Window control buttons not appearing on hover.",
      "Double-clicking on the tab strip not opening a new tab.",
      "Dragging tabs with Glance open acting weird."
    ],
    "features": ["A much better transition between workspaces gradients."],
    "workflowId": 15164169941,
    "image": false,
    "date": "21/05/2025"
  },
  {
    "version": "1.12.8b",
    "extra": "",
    "fixes": [
      "Issues with custom colors on the gradient generator.",
      "Site notifications not appearing unless hovering on the top part of the screen.",
      "Some issues when using Glance and split view simultaneously."
    ],
    "features": ["Private windows will now have 'private spaces'"],
    "workflowId": 15193769814,
    "image": false,
    "date": "23/05/2025"
  },
  {
    "version": "1.12.9b",
    "extra": "This update includes several fixes, security updates, and a few changes! We've bundled the updates for Firefox 139.0 and 139.0.1 into the same release. Since Firefox 139.0 had some rendering issues on Windows for NVIDIA users, we waited an extra day to release this update to ensure the issues were resolved.",
    "fixes": [
      "Pinned- and essential tabs not restoring their icons correctly.",
      "Other issues with split views and Glance.",
      "Compact mode should now work correctly after closing the window — please let us know if you still experience issues."
    ],
    "changes": [
      "Unloaded tabs won't be dimmed unless they are explicitly discarded (browser.tabs.fadeOutUnloadedTabs).",
      "Context menu icons have been removed to provide a cleaner look and feel."
    ],
    "security": "https://www.mozilla.org/en-US/security/advisories/mfsa2025-42/",
    "features": [
      "Updated to Firefox 139.0 and 139.0.1.",
      "Automatic updates for mods.",
      "Automatic tab unloader now uses Firefox's default tab discarding feature, which is based on time and memory usage, instead of the previous time-only method.",
      "Improved performance for rendering rounded corners in the webview.",
      "Enabled the browser to prioritize more important processes when Zen is under memory pressure on macOS.",
      "The context menu item 'Search text on search engine' now opens Glance instead of a new tab."
    ],
    "workflowId": 15356890243,
    "image": false,
    "date": "30/05/2025"
  },
  {
    "version": "1.12.10b",
    "extra": "",
    "fixes": [
      "An issue with migration that led to unexpected behavior on startup, leading to some services being unavailable.",
      "Unloaded pinned tabs using the wrong favicon instead of the cached one.",
      "Gradients not showing when restoring multiple windows at once",
      "Restoring previously closed pinned tabs being on the wrong container."
    ],
    "features": [],
    "workflowId": 15372237282,
    "image": false,
    "date": "01/06/2025"
  },
  {
    "version": "1.13b",
    "extra": "This update includes overall fixes, stability and a new way to manage spaces",
    "fixes": [
      "Fixed issues related to glance and split view",
      "Fixed performance issues and high GPU usage for some users",
      "Other small fixes and improvements"
    ],
    "security": "https://www.mozilla.org/en-US/security/advisories/mfsa2025-47/",
    "features": [
      "There's a new way to manage spaces, which brings a more intuitive and user-friendly experience",
      "Updated to firefox 139.0.4",
      "Added support for google safebrowsing for better security",
      "Collapsed toolbar gets a slight UI redesign"
    ],
    "breakingChanges": [
      "Customizable UI buttons at the bottom has been reset to a new default state"
    ],
    "workflowId": 15630968997,
    "image": false,
    "date": "13/06/2025"
  },
  {
    "version": "1.13.1b",
    "extra": "",
    "fixes": ["Small fixes from the previous release."],
    "features": [],
    "workflowId": 15656297661,
    "image": false,
    "date": "15/06/2025"
  },
  {
    "version": "1.13.2b",
    "extra": "",
    "fixes": [],
    "features": ["Show spaces when right clicking on the workspace indicator"],
    "workflowId": 15668398583,
    "image": false,
    "date": "16/06/2025"
  },
  {
    "version": "1.14b",
    "extra": "",
    "fixes": [
      "Fixed visual twitching when cancelling a drag-to-split operation.",
      "Resolved an issue with tab switching when tabs overflow the toolbar."
    ],
    "features": [
      "Upgraded to Firefox 140.0.2.",
      "Introduced a refreshed look and feel for the color picker.",
      "Added automatic dark/light mode detection based on the browser's background.",
      "Improved gradient rendering to reduce dithering artifacts.",
      "Moved mods to a C++ backend for enhanced performance, stability, and caching.",
      "Made workspace swiping smoother with animated background transitions and improved responsiveness.",
      "Simplified the compact mode toggle: now a single button replaces the previous submenu in single-toolbar setups.",
      "The Add-ons button can now be removed from the toolbar."
    ],
    "changes": [
      "Legacy customization styles are now disabled by default for new users unless a `userChrome.css` file is present.",
      "New user profiles now have container-specific essentials enabled by default."
    ],
    "security": "https://www.mozilla.org/en-US/security/advisories/mfsa2025-51/",
    "workflowId": 15953789168,
    "image": false,
    "date": "29/06/2025"
  },
  {
    "version": "1.14.1b",
    "extra": "",
    "fixes": ["Fixed a crash with third party tools"],
    "features": [],
    "workflowId": 15985890220,
    "image": false,
    "date": "01/07/2025"
  },
  {
    "version": "1.14.2b",
    "extra": "",
    "fixes": ["Fixed an issue when disabling mods"],
    "features": [],
    "workflowId": 16058435355,
    "image": false,
    "date": "03/07/2025"
  }
]
